/* REXX */
/*
 * HANDLE7 - Enumeration des proprietes avec MQINQMP
 *
 *   CONN
 *   -> OPEN
 *   -> creation MH1
 *   -> SETMP de plusieurs proprietes
 *   -> PUT initial
 *   -> suppression MH1
 *   -> creation MH2
 *   -> GET dans MH2
 *   -> enumeration avec %
 *   -> MQIMPO_INQ_FIRST
 *   -> MQIMPO_INQ_NEXT
 *   -> nettoyage
 */
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
mh1cree  = 0
mh2cree  = 0
ouvert   = 0
connecte = 0
rcode    = 0
firstFailure = ''
say "QMGR =" qmgr
say "QUEUE=" qname
say ""
/* --------------------------------------------------------------- */
/* 0. Initialisation                                              */
/* --------------------------------------------------------------- */
  rcc = rxmqinit()
  if word(rcc,1) /= 0      then do
   say time('l') 'probleme initialisation rc ==> ' rcc
   call showerr rcc
   rcode = 8
   signal cleanup
   end
/* --------------------------------------------------------------- */
/* Connexion                                                       */
/* --------------------------------------------------------------- */
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
connecte = 1
/* --------------------------------------------------------------- */
/* Ouverture de la file en entree et en sortie                     */
/* --------------------------------------------------------------- */
iod1.OT = MQOT_Q
iod1.ON = qname
iod1.OQM = ''
oo1 = MQOO_OUTPUT + MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
say "OPEN =" rcc " h1=" h1
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
ouvert = 1
/* --------------------------------------------------------------- */
/* Creation du message handle MH1                                  */
/* --------------------------------------------------------------- */
cmho1.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh1','cmho1.')
say "MH1  =" rcc mh1
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh1cree = 1
/* --------------------------------------------------------------- */
/* Definition des proprietes dans MH1                              */
/* --------------------------------------------------------------- */
smpo1.OPT       = MQSMPO_NONE
pd1.OPT         = MQPD_NONE
pd1.SUPPORT     = MQPD_SUPPORT_OPTIONAL
pd1.CONTEXT     = MQPD_NO_CONTEXT
pd1.COPYOPTIONS = MQCOPY_DEFAULT
rcc=RXMQSMP('mh1','smpo1.','usr.couleur','pd1.',MQTYPE_STRING,'bleu')
say "SMP usr.couleur    =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
rcc=RXMQSMP('mh1','smpo1.','usr.quantite','pd1.',MQTYPE_INT32,25)
say "SMP usr.quantite   =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
rcc=RXMQSMP('mh1','smpo1.','usr.prioritaire','pd1.',MQTYPE_BOOLEAN,1)
say "SMP usr.prioritaire=" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
rcc=RXMQSMP('mh1','smpo1.','usr.montant','pd1.',MQTYPE_FLOAT64,123.45)
say "SMP usr.montant    =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
rcc=RXMQSMP('mh1','smpo1.','usr.client','pd1.',MQTYPE_STRING,'IBM')
say "SMP usr.client     =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Corps du message initial                                       */
/* --------------------------------------------------------------- */
d.1 = 'Message initial pour le test enumeration MQINQMP'
d.0 = length(d.1)
/* --------------------------------------------------------------- */
/* MQMD du PUT                                                     */
/* --------------------------------------------------------------- */
imd2.VER  = MQMD_VERSION_2
imd2.REP  = MQRO_NONE
imd2.MSG  = MQMT_DATAGRAM
imd2.EXP  = MQEI_UNLIMITED
imd2.FBK  = MQFB_NONE
imd2.ENC  = MQENC_NATIVE
imd2.CCSI = MQCCSI_Q_MGR
imd2.FORM = MQFMT_STRING
imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
/* --------------------------------------------------------------- */
/* PUT du message avec les proprietes de MH1                       */
/* --------------------------------------------------------------- */
ipmo2.VER     = MQPMO_VERSION_3
ipmo2.OPT  = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
ipmo2.TIME    = MQWI_UNLIMITED
ipmo2.OMH     = 0
ipmo2.NMH     = mh1
ipmo2.ACT     = MQACTP_NEW
ipmo2.PL      = 0
rcc = RXMQPUT(h1,'d.','imd2.','omd2.','ipmo2.','opmo2.')
say "PUT initial =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Suppression de MH1                                              */
/* --------------------------------------------------------------- */
dmho1.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh1','dmho1.')
say "DMH mh1 =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh1cree = 0
/* --------------------------------------------------------------- */
/* Creation de MH2 pour le GET                                     */
/* --------------------------------------------------------------- */
cmho2.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh2','cmho2.')
say "MH2  =" rcc mh2
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh2cree = 1
/* --------------------------------------------------------------- */
/* GET du message                                                  */
/* --------------------------------------------------------------- */
msg2.0 = 8192
igmd2.VER  = MQMD_VERSION_2
igmd2.ENC  = MQENC_NATIVE
igmd2.CCSI = MQCCSI_Q_MGR
igmd2.FORM = MQFMT_NONE
igmo2.VER   = MQGMO_VERSION_4
igmo2.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT +,
               MQGMO_FAIL_IF_QUIESCING
igmo2.WAIT  = 5000
igmo2.MOPT  = MQMO_NONE
igmo2.MH    = mh2
rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
say "GET initial =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "Corps recu =" msg2.1
say ""
/* --------------------------------------------------------------- */
/* Enumeration des proprietes %                                    */
/* --------------------------------------------------------------- */
say "=============================================="
say "ENUMERATION DES PROPRIETES %"
say "=============================================="
say ""
pnam = '%'
nbprop = 0
impo1.OPT    = MQIMPO_INQ_FIRST + MQIMPO_CONVERT_VALUE
impo1.RQENC  = MQENC_INTEGER_NORMAL + MQENC_DECIMAL_NORMAL +,
                MQENC_FLOAT_IEEE_NORMAL
impo1.RQCCSI = MQCCSI_APPL
do forever
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP('mh2','impo1.',pnam,'pdout.','ptype','pvalue.','pnameout')
   if word(rcc,1) = 0 then do
      nbprop = nbprop + 1
      say "Propriete numero" nbprop
      say "  Nom      =" pnameout
      say "  Type     =" ptype
      say "  Longueur =" pvalue.0
      say "  Valeur   =" pvalue.1
      say "----------------------------------------------"
      impo1.OPT = MQIMPO_INQ_NEXT + MQIMPO_CONVERT_VALUE
   end
   else do
      if word(rcc,1) = MQCC_FAILED &,
         RXMQ.LASTCC = MQCC_FAILED &,
         RXMQ.LASTAC = MQRC_PROPERTY_NOT_AVAILABLE then do
         leave
      end
      else do
         say "Erreur pendant l'enumeration"
         call showerr rcc
         say "  IMP =" rcc
         rcode = 8
         leave
      end
   end
end
/* --------------------------------------------------------------- */
/* Bilan                                                           */
/* --------------------------------------------------------------- */
say ""
say "Nombre de proprietes % trouvees =" nbprop
say ""
if rcode = 0 & nbprop <> 5 then do
   say "KO : nombre de proprietes inattendu :" nbprop
   if firstFailure = '' then
      firstFailure = 'Nombre de proprietes inattendu'
   rcode = 8
end
signal cleanup
/* --------------------------------------------------------------- */
/* Nettoyage unique                                                */
/* --------------------------------------------------------------- */
cleanup:
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh1cree = 0
   end
   if ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else ouvert = 0
   end
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else connecte = 0
   end
say "=============================================="
if rcode = 0 then
   say "TEST PASSED: HANDLE7"
else do
   say "TEST FAILED: HANDLE7"
   say "FIRST FAILURE =" firstFailure
end
say "=============================================="
exit rcode
showerr:
   parse arg errrcc
   if firstFailure = '' then firstFailure = errrcc
   say "LASTRC  =" RXMQ.LASTRC
   say "LASTCC  =" RXMQ.LASTCC
   say "LASTAC  =" RXMQ.LASTAC
   say "LASTMSG =" RXMQ.LASTMSG
return
