/* REXX */
/*
  * HANDLE5 - Copying properties with MQACTP_FORWARD
 *
  * Structure based on HANDLE4:
 *
  * CONN
  * -> OPEN
  * -> create MH1
  * -> SETMP
  * -> PUT initial
  * -> create MH2
  * -> GET initial
  * -> create MH3
  * -> PUT FORWARD with OMH=MH2 and NMH=MH3
  * -> create MH4
  * -> GET the forwarded message
  * -> INQMP
  * -> cleanup
 *
  * RXMQVTRACE = 'CONN OPEN PUT GET CLOSE DISC MH SMP IMP DMH'
 */
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
mh1cree  = 0
mh2cree  = 0
mh3cree  = 0
mh4cree  = 0
ouvert   = 0
connecte = 0
rcode    = 0
say "QMGR =" qmgr
say "QUEUE=" qname
say ""
/* --------------------------------------------------------------- */
/* 0. Initialization */
/* --------------------------------------------------------------- */
  rcc = rxmqinit()
  if word(rcc,1) /= 0      then do
   say time('l') 'initialization problem rc ==> ' rcc
   interpret 'msgerr = rxmq.rcmap.'word(rcc,1)
   say "                                           ==> "msgerr
   exit 8
   end
/* --------------------------------------------------------------- */
/* Connection */
/* --------------------------------------------------------------- */
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
connecte = 1
/* --------------------------------------------------------------- */
/* Open the queue for input and output */
/* --------------------------------------------------------------- */
iod1.OT = MQOT_Q
iod1.ON = qname
iod1.OM = ''
oo1 = MQOO_OUTPUT + MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
say "OPEN =" rcc " h1=" h1
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
ouvert = 1
/* --------------------------------------------------------------- */
/* Create source message handle MH1 */
/* --------------------------------------------------------------- */
cmho1.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh1','cmho1.')
say "MH1  =" rcc mh1
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh1cree = 1
/* --------------------------------------------------------------- */
/* Common property descriptor */
/* --------------------------------------------------------------- */
smpo1.OPT   = MQSMPO_NONE
pd1.OPT     = MQPD_NONE
pd1.SUPPORT = MQPD_SUPPORT_OPTIONAL
pd1.CONTEXT = MQPD_NO_CONTEXT
/* --------------------------------------------------------------- */
/* Property with MQCOPY_DEFAULT */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_DEFAULT
rcc=RXMQSMP('mh1','smpo1.','usr.default','pd1.',MQTYPE_STRING,'blue')
say "SMP usr.default       MQCOPY_DEFAULT =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Property with MQCOPY_FORWARD */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_FORWARD
rcc=RXMQSMP('mh1','smpo1.','usr.forward','pd1.',MQTYPE_INT32,25)
say "SMP usr.forward      MQCOPY_FORWARD =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Property with MQCOPY_REPLY */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_REPLY
rcc=RXMQSMP('mh1','smpo1.','usr.reply','pd1.',MQTYPE_BOOLEAN,1)
say "SMP usr.reply        MQCOPY_REPLY =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Property with MQCOPY_FORWARD and MQCOPY_REPLY */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_FORWARD + MQCOPY_REPLY
rcc=RXMQSMP('mh1','smpo1.','usr.forwrep','pd1.',MQTYPE_FLOAT64,123.45)
say "SMP usr.forwrep      FORWARD + REPLY =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Property with MQCOPY_ALL */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_ALL
rcc=RXMQSMP('mh1','smpo1.','usr.toujours','pd1.',MQTYPE_INT64,5000000000)
say "SMP usr.toujours     MQCOPY_ALL =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Property with MQCOPY_NONE */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_NONE
rcc=RXMQSMP('mh1','smpo1.','usr.jamais','pd1.',MQTYPE_FLOAT32,12.5)
say "SMP usr.jamais       MQCOPY_NONE =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Initial message body */
/* --------------------------------------------------------------- */
d.1 = 'Initial message for the MQACTP_FORWARD'
d.0 = length(d.1)
/* MQMD for the first PUT */
imd2.VER  = MQMD_VERSION_2
imd2.REP  = MQRO_NONE
imd2.MSG  = MQMT_DATAGRAM
imd2.EXP  = MQEI_UNLIMITED
imd2.FBK  = MQFB_NONE
imd2.ENC  = MQENC_NATIVE
imd2.CCSI = MQCCSI_Q_MGR
imd2.FORM = MQFMT_STRING
imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
/* --------------------------------------------------------------- */
/* First PUT: new message with the properties from MH1 */
/* --------------------------------------------------------------- */
ipmo2.VER     = MQPMO_VERSION_3
ipmo2.OPT = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
ipmo2.TIME    = MQWI_UNLIMITED
ipmo2.OMH     = 0
ipmo2.NMH     = mh1
ipmo2.ACT     = MQACTP_NEW
ipmo2.PL      = 0
rcc = RXMQPUT(h1,'d.','imd2.','omd2.','ipmo2.','opmo2.')
say "PUT initial =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Delete MH1 */
/* --------------------------------------------------------------- */
dmho1.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh1','dmho1.')
say "DMH mh1 =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh1cree = 0
/* --------------------------------------------------------------- */
/* Create message handle MH2 for the first GET */
/* --------------------------------------------------------------- */
cmho2.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh2','cmho2.')
say "MH2  =" rcc mh2
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh2cree = 1
/* --------------------------------------------------------------- */
/* GET the initial message */
/* --------------------------------------------------------------- */
msg2.0 = 8192
igmd2.VER  = MQMD_VERSION_2
igmd2.ENC  = MQENC_NATIVE
igmd2.CCSI = MQCCSI_Q_MGR
igmd2.FORM = MQFMT_NONE
igmo2.VER   = MQGMO_VERSION_4
igmo2.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT +,
               MQGMO_FAIL_IF_QUIESCING
igmo2.WAIT  = 5000
igmo2.MOPT  = MQMO_NONE
igmo2.MH    = mh2
rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
say "GET initial =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
say "Initial body =" msg2.1
say ""
/* --------------------------------------------------------------- */
/* Verify properties present in MH2 */
/* before the PUT FORWARD */
/* --------------------------------------------------------------- */
impo1.OPT    = MQIMPO_NONE
impo1.RQENC  = MQENC_NATIVE
impo1.RQCCSI = MQCCSI_APPL
say "Verify properties before FORWARD"
say ""
handleinq = 'mh2'
call verifpresente 'usr.default',MQTYPE_STRING,'blue'
call verifpresente 'usr.forward',MQTYPE_INT32,'25'
call verifpresente 'usr.reply',MQTYPE_BOOLEAN,'1'
call verifpresente 'usr.forwrep',MQTYPE_FLOAT64,'123.45'
call verifpresente 'usr.toujours',MQTYPE_INT64,'5000000000'
call verifpresente 'usr.jamais',MQTYPE_FLOAT32,'12.5'
if rcode <> 0 then signal cleanup
/* --------------------------------------------------------------- */
/* Create MH3: NewMsgHandle for the PUT FORWARD */
/* --------------------------------------------------------------- */
cmho3.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh3','cmho3.')
say "MH3  =" rcc mh3
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh3cree = 1
/* --------------------------------------------------------------- */
/* Second PUT with MQACTP_FORWARD */
/*                                                               */
/* MH2 is the original message handle. */
/* MH3 is the new message handle. */
/* MQ copies properties from MH2 to MH3 according to MQPD.CopyOptions. */
/* --------------------------------------------------------------- */
msgf.1 = msg2.1
msgf.0 = length(msgf.1)
imd3.VER  = MQMD_VERSION_2
imd3.REP  = MQRO_NONE
imd3.MSG  = MQMT_DATAGRAM
imd3.EXP  = MQEI_UNLIMITED
imd3.FBK  = MQFB_NONE
imd3.ENC  = MQENC_NATIVE
imd3.CCSI = MQCCSI_Q_MGR
imd3.FORM = MQFMT_STRING
imd3.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd3.PER  = MQPER_PERSISTENCE_AS_Q_DEF
ipmo3.VER     = MQPMO_VERSION_3
ipmo3.OPT = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
ipmo3.TIME    = MQWI_UNLIMITED
ipmo3.OMH     = mh2
ipmo3.NMH     = mh3
ipmo3.ACT     = MQACTP_FORWARD
ipmo3.PL      = 0
say ""
say "PUT FORWARD"
say "  OriginalMsgHandle =" ipmo3.OMH
say "  NewMsgHandle      =" ipmo3.NMH
say "  Action            =" ipmo3.ACT
rcc = RXMQPUT(h1,'msgf.','imd3.','omd3.','ipmo3.','opmo3.')
say "PUT forward =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Delete the handles used by the PUT FORWARD */
/* --------------------------------------------------------------- */
dmho2.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh2','dmho2.')
say "DMH mh2 =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh2cree = 0
dmho3.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh3','dmho3.')
say "DMH mh3 =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh3cree = 0
/* --------------------------------------------------------------- */
/* Create MH4 to receive the forwarded message */
/* --------------------------------------------------------------- */
cmho4.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh4','cmho4.')
say "MH4  =" rcc mh4
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh4cree = 1
/* --------------------------------------------------------------- */
/* GET the forwarded message */
/* --------------------------------------------------------------- */
msg4.0 = 8192
igmd4.VER  = MQMD_VERSION_2
igmd4.ENC  = MQENC_NATIVE
igmd4.CCSI = MQCCSI_Q_MGR
igmd4.FORM = MQFMT_NONE
igmo4.VER   = MQGMO_VERSION_4
igmo4.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT +,
               MQGMO_FAIL_IF_QUIESCING
igmo4.WAIT  = 5000
igmo4.MOPT  = MQMO_NONE
igmo4.MH    = mh4
rcc = RXMQGET(h1,'msg4.','igmd4.','ogmd4.','igmo4.','ogmo4.')
say "GET forward =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
say "Forwarded body =" msg4.1
say ""
/* --------------------------------------------------------------- */
/* Verify properties after MQACTP_FORWARD */
/* --------------------------------------------------------------- */
say "Verify properties after MQACTP_FORWARD"
say ""
handleinq = 'mh4'
say "MQCOPY_DEFAULT : expected property is present"
call verifpresente 'usr.default',MQTYPE_STRING,'blue'
say "MQCOPY_FORWARD : expected property is present"
call verifpresente 'usr.forward',MQTYPE_INT32,'25'
say "MQCOPY_REPLY : expected property is absent"
call verifabsente 'usr.reply'
say "MQCOPY_FORWARD + MQCOPY_REPLY : expected property is present"
call verifpresente 'usr.forwrep',MQTYPE_FLOAT64,'123.45'
say "MQCOPY_ALL : expected property is present"
call verifpresente 'usr.toujours',MQTYPE_INT64,'5000000000'
say "MQCOPY_NONE : expected property is absent"
call verifabsente 'usr.jamais'
/* --------------------------------------------------------------- */
/* Summary */
/* --------------------------------------------------------------- */
say ""
if rcode = 0 then do
   say "=============================================="
   say "TEST PASSED: MQACTP_FORWARD"
   say "=============================================="
end
else do
   say "=============================================="
   say "TEST FAILED: MQACTP_FORWARD"
   say "=============================================="
end
signal cleanup
/* --------------------------------------------------------------- */
/* Verify a property that is expected to be present */
/* --------------------------------------------------------------- */
verifpresente:
   parse arg nomatt,typeatt,valatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,1) <> 0 then do
      say "  FAILED: expected property is present"
      rcode = 8
      say "----------------------------------------------"
      return
   end
   say "  name      =" pnameout
   say "  type     =" ptype "(expected" typeatt")"
   say "  longueur =" pvalue.0
   say "  value     =" pvalue.1 "(expected" valatt")"
   if ptype <> typeatt then do
      say "  FAILED: unexpected type"
      rcode = 8
   end
   else if pvalue.1 <> valatt then do
      if typeatt = MQTYPE_FLOAT32 then do
         if pvalue.1 = valatt + 0 then
            say "  OK: numerically equivalent value"
         else do
            say "  FAILED: unexpected value"
            rcode = 8
         end
      end
      else if typeatt = MQTYPE_FLOAT64 then do
         if pvalue.1 = valatt + 0 then
            say "  OK: numerically equivalent value"
         else do
            say "  FAILED: unexpected value"
            rcode = 8
         end
      end
      else do
         say "  FAILED: unexpected value"
         rcode = 8
      end
   end
   else
      say "  OK"
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Verify a property that is expected to be absent */
/* --------------------------------------------------------------- */
verifabsente:
   parse arg nomatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,3) = MQRC_PROPERTY_NOT_AVAILABLE then do
      say "  OK: property is absent"
   end
   else do
      if word(rcc,1) = 0 then do
         say "  FAILED: property is present"
         say "  type   =" ptype
         say "  value =" pvalue.1
      end
      else do
         say "  FAILED: unexpected error"
         say "  return =" rcc
      end
      rcode = 8
   end
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Single cleanup path */
/* --------------------------------------------------------------- */
cleanup:
   if mh4cree = 1 then do
      dmho4.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh4','dmho4.')
      say "DMH mh4 =" rcc2
      mh4cree = 0
   end
   if mh3cree = 1 then do
      dmho3.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh3','dmho3.')
      say "DMH mh3 =" rcc2
      mh3cree = 0
   end
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      mh1cree = 0
   end
   if ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE =" rcc2
      ouvert = 0
   end
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC  =" rcc2
      connecte = 0
   end
exit rcode

