/* REXX */
/*
  * HANDLE9 - Testing MQPD_USER_CONTEXT
 *
  * Objective: clearly distinguish two mechanisms:
 *
  * 1. Message context:
  * MQOO_SAVE_ALL_CONTEXT
  * MQOO_PASS_ALL_CONTEXT
  * MQPMO_PASS_ALL_CONTEXT
  * MQPMO.Context = handle of the queue used for MQGET
 *
  * 2. Normal property copying:
  * OriginalMsgHandle
  * NewMsgHandle
  * MQPMO.Action
  * MQPD.CopyOptions
 *
  * This sample does NOT use OriginalMsgHandle, NewMsgHandle, or Action
  * during the second PUT. It therefore isolates only the mechanism
  * used to pass context.
 *
  * Two properties are placed in the initial message:
 *
  * usr.normal
  * Context = MQPD_NO_CONTEXT
 *
  * usr.context
  * Context = MQPD_USER_CONTEXT
 *
  * Both properties use MQCOPY_NONE so that no normal copy
  * through Action/CopyOptions can occur.
 *
  * Cases tested:
 *
  * 1 - GET without SAVE_ALL_CONTEXT
  * PUT without PASS_ALL_CONTEXT
 *
  * 2 - GET with SAVE_ALL_CONTEXT
  * PUT without PASS_ALL_CONTEXT
 *
  * 3 - GET with SAVE_ALL_CONTEXT
  * PUT with PASS_IDENTITY_CONTEXT
 *
  * 4 - GET with SAVE_ALL_CONTEXT
  * PUT with PASS_ALL_CONTEXT
 *
  * MA95 stems used:
  * MQPMO : .VER .OPT .TIME .CON .OMH .NMH .ACT .PL
  * MQGMO : .VER .OPT .WAIT .MOPT .MH
  * MQPD  : .VER .OPT .SUPPORT .CONTEXT .COPYOPTIONS
 *
  * Main expected result:
 *
  * usr.normal   : absent from every copied message
  * usr.context : present only in case 4
 */
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
connecte = 0
rcode    = 0
say "QMGR =" qmgr
say "QUEUE=" qname
say ""
/* --------------------------------------------------------------- */
/* Initialization */
/* --------------------------------------------------------------- */
rcc = rxmqinit()
if word(rcc,1) /= 0 then do
   say time('l') 'initialization problem rc ==> ' rcc
   interpret 'msgerr = rxmq.rcmap.'word(rcc,1)
   say "                                           ==> "msgerr
   exit 8
end
/* --------------------------------------------------------------- */
/* Connection */
/* --------------------------------------------------------------- */
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then exit 8
connecte = 1
/* --------------------------------------------------------------- */
/* Run the four cases */
/* --------------------------------------------------------------- */
call testcas 1,0,0,'NONE'
call testcas 2,1,0,'NONE'
call testcas 3,1,1,'IDENTITY'
call testcas 4,1,1,'ALL'
/* --------------------------------------------------------------- */
/* Summary */
/* --------------------------------------------------------------- */
say ""
if rcode = 0 then do
   say "============================================================"
   say "TEST PASSED: MQPD_USER_CONTEXT"
   say "============================================================"
end
else do
   say "============================================================"
   say "TEST FAILED: MQPD_USER_CONTEXT"
   say "============================================================"
end
signal cleanup
/* --------------------------------------------------------------- */
/* Run one case */
/* --------------------------------------------------------------- */
testcas:
   parse arg numcas,savecontext,passcontext,modepass
   h1ouvert = 0
   h2ouvert = 0
   mh1cree  = 0
   mh2cree  = 0
   mh3cree  = 0
   casok    = 1
   say ""
   say "============================================================"
   say "CASE" numcas
   say "SAVE_ALL_CONTEXT =" savecontext
   say "PASS CONTEXT     =" modepass
   say "============================================================"
   /* ------------------------------------------------------------ */
   /* Open the input queue */
   /* ------------------------------------------------------------ */
   iod1.OT = MQOT_Q
   iod1.ON = qname
   iod1.OM = ''
   oo1 = MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
   if savecontext = 1 then
      oo1 = oo1 + MQOO_SAVE_ALL_CONTEXT
   rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
   say "OPEN input =" rcc " h1=" h1
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   h1ouvert = 1
   /* ------------------------------------------------------------ */
   /* Open the output queue */
   /* ------------------------------------------------------------ */
   iod2.OT = MQOT_Q
   iod2.ON = qname
   iod2.OM = ''
   oo2 = MQOO_OUTPUT + MQOO_FAIL_IF_QUIESCING
   if passcontext = 1 then do
      if modepass = 'IDENTITY' then
         oo2 = oo2 + MQOO_PASS_IDENTITY_CONTEXT
      else if modepass = 'ALL' then
         oo2 = oo2 + MQOO_PASS_ALL_CONTEXT
   end
   rcc = RXMQOPEN('iod2.',oo2,'h2','ood2.')
   say "OPEN output =" rcc " h2=" h2
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   h2ouvert = 1
   /* ------------------------------------------------------------ */
   /* Create MH1 for the initial message */
   /* ------------------------------------------------------------ */
   cmho1.OPT = MQCMHO_VALIDATE
   rcc = RXMQMH('mh1','cmho1.')
   say "MH1 =" rcc mh1
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   mh1cree = 1
   /* ------------------------------------------------------------ */
   /* Normal property */
   /* ------------------------------------------------------------ */
   drop smpo1. pdnormal.
   smpo1.OPT             = MQSMPO_NONE
   pdnormal.VER          = MQPD_VERSION_1
   pdnormal.OPT          = MQPD_NONE
   pdnormal.SUPPORT      = MQPD_SUPPORT_OPTIONAL
   pdnormal.CONTEXT      = MQPD_NO_CONTEXT
   pdnormal.COPYOPTIONS  = MQCOPY_NONE
   rcc=RXMQSMP('mh1','smpo1.','usr.normal','pdnormal.',MQTYPE_STRING,'normale')
   say "SMP usr.normal   NO_CONTEXT   =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   /* ------------------------------------------------------------ */
   /* Property belonging to user context */
   /* ------------------------------------------------------------ */
   drop pdconte.
   pdconte.VER            = MQPD_VERSION_1
   pdconte.OPT            = MQPD_NONE
   pdconte.SUPPORT        = MQPD_SUPPORT_OPTIONAL
   pdconte.CONTEXT        = MQPD_USER_CONTEXT
   pdconte.COPYOPTIONS = MQCOPY_NONE
 rcc=RXMQSMP('mh1','smpo1.','usr.context','pdconte.',MQTYPE_STRING,'contexte')
   say "SMP usr.context USER_CONTEXT =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   /* ------------------------------------------------------------ */
   /* First PUT: create the initial message */
   /* ------------------------------------------------------------ */
   d.1 = 'Initial message for MQPD_USER_CONTEXT case 'numcas
   d.0 = length(d.1)
   imd2.VER  = MQMD_VERSION_2
   imd2.REP  = MQRO_NONE
   imd2.MSG  = MQMT_DATAGRAM
   imd2.EXP  = MQEI_UNLIMITED
   imd2.FBK  = MQFB_NONE
   imd2.ENC  = MQENC_NATIVE
   imd2.CCSI = MQCCSI_Q_MGR
   imd2.FORM = MQFMT_STRING
   imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
   imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
   ipmo2.VER     = MQPMO_VERSION_3
   ipmo2.OPT     = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING +,
                   MQPMO_DEFAULT_CONTEXT
   ipmo2.TIME    = MQWI_UNLIMITED
   drop ipmo2.CON
   ipmo2.OMH     = 0
   ipmo2.NMH     = mh1
   ipmo2.ACT     = MQACTP_NEW
   ipmo2.PL      = 0
   rcc = RXMQPUT(h2,'d.','imd2.','omd2.','ipmo2.','opmo2.')
   say "PUT initial =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   dmho1.OPT = MQDMHO_NONE
   rcc = RXMQDMH('mh1','dmho1.')
   say "DMH mh1 =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   mh1cree = 0
   /* ------------------------------------------------------------ */
   /* GET the initial message */
   /* ------------------------------------------------------------ */
   cmho2.OPT = MQCMHO_VALIDATE
   rcc = RXMQMH('mh2','cmho2.')
   say "MH2 =" rcc mh2
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   mh2cree = 1
   msg2.0 = 8192
   igmd2.VER  = MQMD_VERSION_2
   igmd2.ENC  = MQENC_NATIVE
   igmd2.CCSI = MQCCSI_Q_MGR
   igmd2.FORM = MQFMT_NONE
   igmo2.VER   = MQGMO_VERSION_4
   igmo2.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT + MQGMO_FAIL_IF_QUIESCING
   igmo2.WAIT  = 5000
   igmo2.MOPT = MQMO_NONE
   igmo2.MH    = mh2
   rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
   say "GET initial =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   say "Initial body =" msg2.1
   /* ------------------------------------------------------------ */
   /* Verify properties in MH2 */
   /* ------------------------------------------------------------ */
   impo1.OPT    = MQIMPO_NONE
   impo1.RQENC  = MQENC_NATIVE
   impo1.RQCCSI = MQCCSI_APPL
   handleinq = 'mh2'
   say ""
   say "Properties after the initial GET"
   call verifpresente 'usr.normal',MQTYPE_STRING,'normale',MQPD_NO_CONTEXT
   call verifpresente 'usr.context',MQTYPE_STRING,'contexte',MQPD_USER_CONTEXT
   if casok = 0 then signal nettoiecas
   /* ------------------------------------------------------------ */
   /* Second PUT: no message handle is supplied */
   /* ------------------------------------------------------------ */
   msg3.1 = 'Message created from the context of case 'numcas
   msg3.0 = length(msg3.1)
   imd3.VER  = MQMD_VERSION_2
   imd3.REP  = MQRO_NONE
   imd3.MSG  = MQMT_DATAGRAM
   imd3.EXP  = MQEI_UNLIMITED
   imd3.FBK  = MQFB_NONE
   imd3.ENC  = MQENC_NATIVE
   imd3.CCSI = MQCCSI_Q_MGR
   imd3.FORM = MQFMT_STRING
   imd3.PRI  = MQPRI_PRIORITY_AS_Q_DEF
   imd3.PER  = MQPER_PERSISTENCE_AS_Q_DEF
   ipmo3.VER     = MQPMO_VERSION_3
 ipmo3.OPT=MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING +MQPMO_DEFAULT_CONTEXT
   ipmo3.TIME    = MQWI_UNLIMITED
   drop ipmo3.CON
   ipmo3.OMH     = 0
   ipmo3.NMH     = 0
   ipmo3.ACT     = MQACTP_NEW
   ipmo3.PL      = 0
   if modepass = 'IDENTITY' then do
ipmo3.OPT=MQPMO_NO_SYNCPOINT+MQPMO_FAIL_IF_QUIESCING+MQPMO_PASS_IDENTITY_CONTEXT
      ipmo3.CON = h1
   end
   else if modepass = 'ALL' then do
 ipmo3.OPT =MQPMO_NO_SYNCPOINT+MQPMO_FAIL_IF_QUIESCING+MQPMO_PASS_ALL_CONTEXT
      ipmo3.CON = h1
   end
   else do
 ipmo3.OPT =MQPMO_NO_SYNCPOINT+MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
 end
   say ""
   say "Second PUT"
   say "  PMO.Options =" ipmo3.OPT
   if symbol("ipmo3.CON") = "VAR" then,
      say "  PMO.Context =" ipmo3.CON
   else,
      say "  PMO.Context = not set"
   rcc = RXMQPUT(h2,'msg3.','imd3.','omd3.','ipmo3.','opmo3.')
   say "Context PUT =" rcc
   if word(rcc,1) <> 0 then do
      say "The PUT failed. Check context authorities."
      casok = 0
      signal nettoiecas
   end
   /* ------------------------------------------------------------ */
   /* The context saved in h1 is no longer required */
   /* ------------------------------------------------------------ */
   dmho2.OPT = MQDMHO_NONE
   rcc = RXMQDMH('mh2','dmho2.')
   say "DMH mh2 =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   mh2cree = 0
   /* ------------------------------------------------------------ */
   /* GET the message created by the second PUT */
   /* ------------------------------------------------------------ */
   cmho3.OPT = MQCMHO_VALIDATE
   rcc = RXMQMH('mh3','cmho3.')
   say "MH3 =" rcc mh3
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   mh3cree = 1
   msg4.0 = 8192
   igmd4.VER  = MQMD_VERSION_2
   igmd4.ENC  = MQENC_NATIVE
   igmd4.CCSI = MQCCSI_Q_MGR
   igmd4.FORM = MQFMT_NONE
   igmo4.VER   = MQGMO_VERSION_4
   igmo4.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT + MQGMO_FAIL_IF_QUIESCING
   igmo4.WAIT  = 5000
   igmo4.MOPT = MQMO_NONE
   igmo4.MH    = mh3
   rcc = RXMQGET(h1,'msg4.','igmd4.','ogmd4.','igmo4.','ogmo4.')
   say "Context GET =" rcc
   if word(rcc,1) <> 0 then do
      casok = 0
      signal nettoiecas
   end
   say "Context message body =" msg4.1
   /* ------------------------------------------------------------ */
   /* Final verification */
   /* ------------------------------------------------------------ */
   handleinq = 'mh3'
   say ""
   say "Final verification"
   say "usr.normal must always be absent"
   call verifabsente 'usr.normal'
   if modepass = 'ALL' then do
      say "usr.context must be present"
 call verifpresente 'usr.context',MQTYPE_STRING,'contexte',MQPD_USER_CONTEXT
   end
   else do
      say "usr.context must be absent"
      call verifabsente 'usr.context'
   end
   signal nettoiecas
/* --------------------------------------------------------------- */
/* Verify a present property */
/* --------------------------------------------------------------- */
verifpresente:
   parse arg nomatt,typeatt,valatt,contextatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,1) <> 0 then do
      say "  FAILED: expected property is present"
      casok = 0
      say "----------------------------------------------"
      return
   end
   say "  name         =" pnameout
   say "  type         =" ptype "(expected" typeatt")"
   say "  value       =" pvalue.1 "(expected" valatt")"
   say "  PD.Context   =" pdout.CONTEXT "(expected" contextatt")"
   say "  CopyOptions  =" pdout.COPYOPTIONS
   if ptype <> typeatt then do
      say "  FAILED: unexpected type"
      casok = 0
   end
   else if pvalue.1 <> valatt then do
      say "  FAILED: unexpected value"
      casok = 0
   end
   else if pdout.CONTEXT <> contextatt then do
      say "  FAILED: unexpected context"
      casok = 0
   end
   else
      say "  OK"
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Verify an absent property */
/* --------------------------------------------------------------- */
verifabsente:
   parse arg nomatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,3) = MQRC_PROPERTY_NOT_AVAILABLE then do
      say "  OK: property is absent"
   end
   else do
      if word(rcc,1) = 0 then do
         say "  FAILED: property is present"
         say "  type         =" ptype
         say "  value       =" pvalue.1
         say "  PD.Context   =" pdout.CONTEXT
         say "  CopyOptions  =" pdout.COPYOPTIONS
      end
      else do
         say "  FAILED: unexpected error"
         say "  return =" rcc
      end
      casok = 0
   end
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Case cleanup */
/* --------------------------------------------------------------- */
nettoiecas:
   if mh3cree = 1 then do
      dmho3.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh3','dmho3.')
      say "DMH mh3 =" rcc2
      mh3cree = 0
   end
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      mh1cree = 0
   end
   if h2ouvert = 1 then do
      rcc2 = RXMQCLOS(h2,0)
      say "CLOSE h2 =" rcc2
      h2ouvert = 0
   end
   if h1ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE h1 =" rcc2
      h1ouvert = 0
   end
   if casok = 1 then
      say "CASE" numcas "OK"
   else do
      say "CASE" numcas "KO"
      rcode = 8
   end
return
/* --------------------------------------------------------------- */
/* General cleanup */
/* --------------------------------------------------------------- */
cleanup:
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC =" rcc2
      connecte = 0
   end
exit rcode
