/* REXX */
/*
RXMQVTRACE = 'CONN OPEN PUT GET CLOSE DISC MH SMP MBF BMH IMP DMH'
*/
TRACE o
mh1cree = 0
mh2cree = 0
ouvert = 0
connecte = 0
rcode = 0
firstFailure = ''
rcc = RXMQCONS()
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
say "QMGR =" qmgr
say "QUEUE=" qname
/* --------------------------------------------------------------- */
/* 0. Initialisation                                              */
/* --------------------------------------------------------------- */
  rcc = rxmqinit()
  if word(rcc,1) /= 0      then do
   say time('l') 'probleme initialisation rc ==> ' rcc
   call showerr rcc
   rcode = 8
   signal cleanup
   end
/* Connexion */
rcc = RXMQCONN(qmgr)
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
connecte = 1
say "CONN =" rcc
/* OPEN */
/* OPEN */
iod1.OT = MQOT_Q
iod1.ON = qname
iod1.OQM = ''
oo1 = MQOO_OUTPUT + MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
rcc = RXMQOPEN('iod1.', oo1, 'h1', 'ood1.')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
ouvert = 1
say "OPEN =" rcc " h1=" h1
/* MH source */
/* cmho1.OPT = MQCMHO_NONE*/
/* cmho1.OPT = MQCMHO_NO_VALIDATION */
cmho1.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh1','cmho1.')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh1cree = 1
say "MH1 =" rcc mh1
/* Property usr.couleur = rouge */
smpo1.OPT = MQSMPO_NONE
pd1.OPT = MQPD_NONE
pd1.SUPPORT = MQPD_SUPPORT_OPTIONAL
pd1.CONTEXT = MQPD_NO_CONTEXT
pd1.COPYOPTIONS = MQCOPY_DEFAULT
/* Propriete 1 */
rcc = RXMQSMP('mh1','smpo1.','usr.couleur','pd1.',MQTYPE_STRING,'rouge')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "SMP couleur =" rcc
/* Propriete 2 */
rcc = RXMQSMP('mh1','smpo1.','usr.forme','pd1.',MQTYPE_STRING,'carre')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "SMP forme =" rcc
/* MH -> buffer RFH2 */
mhbo1.OPT = MQMHBO_PROPERTIES_IN_MQRFH2
mhbo1.VER = MQMHBO_VERSION_1
md1.VER  = MQMD_VERSION_2
md1.REP  = MQRO_NONE
md1.MSG  = MQMT_DATAGRAM
md1.EXP  = MQEI_UNLIMITED
md1.FBK  = MQFB_NONE
md1.ENC  = MQENC_NATIVE
md1.CCSI = MQCCSI_Q_MGR
md1.FORM = MQFMT_STRING
md1.PRI  = MQPRI_PRIORITY_AS_Q_DEF
md1.PER  = MQPER_PERSISTENCE_AS_Q_DEF
rcc = RXMQMBF('mh1','mhbo1.','usr.%','md1.','buf',8192,'blen')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "MBF =" rcc
say "MD.CCSI =" md1.CCSI
say "MD.ENC  =" md1.ENC
say "MD.FORM =" md1.FORM
say "buf length =" length(buf)
say "blen       =" blen
say "buf hex    =" c2x(substr(buf,1,64))
/* Cr{ation du handle qui recevra les propri{t{s du buffer */
cmho2.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh2','cmho2.')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh2cree = 1
say "MH2 =" rcc mh2
/* Conversion du buffer MQRFH2 vers le message handle mh2 */
bmho1.OPT = MQBMHO_NONE
/* Construire le stem attendu par RXMQBMH */
drop bmhbuf.
bmhbuf.0 = blen
bmhbuf.1 = buf
rcc = RXMQBMH('mh2','bmho1.','md1.','bmhbuf.')
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "BMH =" rcc
/* Lecture des propri{t{s reconstruites dans mh2 */
impo1.OPT = MQIMPO_INQ_FIRST + MQIMPO_CONVERT_VALUE
impo1.RQENC  = MQENC_NATIVE
impo1.RQCCSI = MQCCSI_APPL
pname = 'usr.%'
do forever
  pvalue.1 = ''
  pvalue.0 = 4096
  pnameout = ''
  ptype    = ''
rcc = RXMQIMP('mh2','impo1.',pname,'pdout.','ptype','pvalue.','pnameout')
   if word(rcc,1) <> 0 then do
      if word(rcc,1) = MQCC_FAILED &,
         RXMQ.LASTCC = MQCC_FAILED &,
         RXMQ.LASTAC = MQRC_PROPERTY_NOT_AVAILABLE then leave
      call showerr rcc
      rcode = 8
      signal cleanup
   end
  say "Nom      =" pnameout
  say "Type     =" ptype
  say "Longueur =" pvalue.0
  say "Valeur   =" pvalue.1
  say "rcc      =" rcc
  say "------------------------------"
  impo1.OPT = MQIMPO_INQ_NEXT + MQIMPO_CONVERT_VALUE
end
cleanup:
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh1cree = 0
   end
   if ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else ouvert = 0
   end
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else connecte = 0
   end
say "=============================================="
if rcode = 0 then
   say "TEST PASSED: HANDLE3"
else do
   say "TEST FAILED: HANDLE3"
   say "FIRST FAILURE =" firstFailure
end
say "=============================================="
exit rcode
showerr:
   parse arg errrcc
   if firstFailure = '' then firstFailure = errrcc
   say "LASTRC  =" RXMQ.LASTRC
   say "LASTCC  =" RXMQ.LASTCC
   say "LASTAC  =" RXMQ.LASTAC
   say "LASTMSG =" RXMQ.LASTMSG
return
