/* REXX */
/*
 * HANDLE9 - Test de MQPD_USER_CONTEXT
 *
 * Objectif : distinguer clairement deux mecanismes :
 *
 *   1. Le contexte du message :
 *        MQOO_SAVE_ALL_CONTEXT
 *        MQOO_PASS_ALL_CONTEXT
 *        MQPMO_PASS_ALL_CONTEXT
 *        MQPMO.Context = handle de la file du MQGET
 *
 *   2. La copie normale des proprietes :
 *        OriginalMsgHandle
 *        NewMsgHandle
 *        MQPMO.Action
 *        MQPD.CopyOptions
 *
 * Ce sample n'utilise PAS OriginalMsgHandle, NewMsgHandle ni Action
 * pendant le deuxieme PUT. Il isole donc uniquement le mecanisme
 * de passage du contexte.
 *
 * Deux proprietes sont placees dans le message initial :
 *
 *   usr.normal
 *      Context = MQPD_NO_CONTEXT
 *
 *   usr.contexte
 *      Context = MQPD_USER_CONTEXT
 *
 * Les deux proprietes utilisent MQCOPY_NONE afin qu'aucune copie
 * normale par Action/CopyOptions ne puisse intervenir.
 *
 * Cas testes :
 *
 *   1 - GET sans SAVE_ALL_CONTEXT
 *       PUT sans PASS_ALL_CONTEXT
 *
 *   2 - GET avec SAVE_ALL_CONTEXT
 *       PUT sans PASS_ALL_CONTEXT
 *
 *   3 - GET avec SAVE_ALL_CONTEXT
 *       PUT avec PASS_IDENTITY_CONTEXT
 *
 *   4 - GET avec SAVE_ALL_CONTEXT
 *       PUT avec PASS_ALL_CONTEXT
 *
 * Stems MA95 utilises :
 *   MQPMO : .VER .OPT .TIME .CON .OMH .NMH .ACT .PL
 *   MQGMO : .VER .OPT .WAIT .MOPT .MH
 *   MQPD  : .VER .OPT .SUPPORT .CONTEXT .COPYOPTIONS
 *
 * Resultat principal attendu :
 *
 *   usr.normal   : absente dans tous les messages recopies
 *   usr.contexte : presente uniquement dans le cas 4
 */
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
connecte = 0
rcode    = 0
firstFailure = ''
say "QMGR =" qmgr
say "QUEUE=" qname
say ""
/* --------------------------------------------------------------- */
/* Initialisation                                                  */
/* --------------------------------------------------------------- */
rcc = rxmqinit()
if word(rcc,1) /= 0 then do
   say time('l') 'probleme initialisation rc ==> ' rcc
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Connexion                                                       */
/* --------------------------------------------------------------- */
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
connecte = 1
/* --------------------------------------------------------------- */
/* Execution des quatre cas                                       */
/* --------------------------------------------------------------- */
call testcas 1,0,0,'NONE'
if rcode <> 0 then signal cleanup
call testcas 2,1,0,'NONE'
if rcode <> 0 then signal cleanup
call testcas 3,1,1,'IDENTITY'
if rcode <> 0 then signal cleanup
call testcas 4,1,1,'ALL'
if rcode <> 0 then signal cleanup
/* --------------------------------------------------------------- */
/* Bilan                                                           */
/* --------------------------------------------------------------- */
say ""
signal cleanup
/* --------------------------------------------------------------- */
/* Execution d'un cas                                              */
/* --------------------------------------------------------------- */
testcas:
   parse arg numcas,savecontext,passcontext,modepass
   h1ouvert = 0
   h2ouvert = 0
   mh1cree  = 0
   mh2cree  = 0
   mh3cree  = 0
   casok    = 1
   say ""
   say "============================================================"
   say "CAS" numcas
   say "SAVE_ALL_CONTEXT =" savecontext
   say "PASS CONTEXT     =" modepass
   say "============================================================"
   /* ------------------------------------------------------------ */
   /* Ouverture de la file d'entree                               */
   /* ------------------------------------------------------------ */
   iod1.OT = MQOT_Q
   iod1.ON = qname
   iod1.OQM = ''
   oo1 = MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
   if savecontext = 1 then
      oo1 = oo1 + MQOO_SAVE_ALL_CONTEXT
   rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
   say "OPEN entree =" rcc " h1=" h1
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   h1ouvert = 1
   /* ------------------------------------------------------------ */
   /* Ouverture de la file de sortie                              */
   /* ------------------------------------------------------------ */
   iod2.OT = MQOT_Q
   iod2.ON = qname
   iod2.OQM = ''
   oo2 = MQOO_OUTPUT + MQOO_FAIL_IF_QUIESCING
   if passcontext = 1 then do
      if modepass = 'IDENTITY' then
         oo2 = oo2 + MQOO_PASS_IDENTITY_CONTEXT
      else if modepass = 'ALL' then
         oo2 = oo2 + MQOO_PASS_ALL_CONTEXT
   end
   rcc = RXMQOPEN('iod2.',oo2,'h2','ood2.')
   say "OPEN sortie =" rcc " h2=" h2
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   h2ouvert = 1
   /* ------------------------------------------------------------ */
   /* Creation de MH1 pour le message initial                     */
   /* ------------------------------------------------------------ */
   cmho1.OPT = MQCMHO_VALIDATE
   rcc = RXMQMH('mh1','cmho1.')
   say "MH1 =" rcc mh1
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   mh1cree = 1
   /* ------------------------------------------------------------ */
   /* Propriete normale                                            */
   /* ------------------------------------------------------------ */
   drop smpo1. pdnormal.
   smpo1.OPT             = MQSMPO_NONE
   pdnormal.VER          = MQPD_VERSION_1
   pdnormal.OPT          = MQPD_NONE
   pdnormal.SUPPORT      = MQPD_SUPPORT_OPTIONAL
   pdnormal.CONTEXT      = MQPD_NO_CONTEXT
   pdnormal.COPYOPTIONS  = MQCOPY_NONE
   rcc=RXMQSMP('mh1','smpo1.','usr.normal','pdnormal.',MQTYPE_STRING,'normale')
   say "SMP usr.normal   NO_CONTEXT   =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   /* ------------------------------------------------------------ */
   /* Propriete appartenant au user context                        */
   /* ------------------------------------------------------------ */
   drop pdconte.
   pdconte.VER            = MQPD_VERSION_1
   pdconte.OPT            = MQPD_NONE
   pdconte.SUPPORT        = MQPD_SUPPORT_OPTIONAL
   pdconte.CONTEXT        = MQPD_USER_CONTEXT
   pdconte.COPYOPTIONS = MQCOPY_NONE
 rcc=RXMQSMP('mh1','smpo1.','usr.contexte','pdconte.',MQTYPE_STRING,'contexte')
   say "SMP usr.contexte USER_CONTEXT =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   /* ------------------------------------------------------------ */
   /* Premier PUT : creation du message initial                    */
   /* ------------------------------------------------------------ */
   d.1 = 'Message initial pour MQPD_USER_CONTEXT cas 'numcas
   d.0 = length(d.1)
   imd2.VER  = MQMD_VERSION_2
   imd2.REP  = MQRO_NONE
   imd2.MSG  = MQMT_DATAGRAM
   imd2.EXP  = MQEI_UNLIMITED
   imd2.FBK  = MQFB_NONE
   imd2.ENC  = MQENC_NATIVE
   imd2.CCSI = MQCCSI_Q_MGR
   imd2.FORM = MQFMT_STRING
   imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
   imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
   ipmo2.VER     = MQPMO_VERSION_3
   ipmo2.OPT     = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING +,
                   MQPMO_DEFAULT_CONTEXT
   ipmo2.TIME    = MQWI_UNLIMITED
   drop ipmo2.CON
   ipmo2.OMH     = 0
   ipmo2.NMH     = mh1
   ipmo2.ACT     = MQACTP_NEW
   ipmo2.PL      = 0
   rcc = RXMQPUT(h2,'d.','imd2.','omd2.','ipmo2.','opmo2.')
   say "PUT initial =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   dmho1.OPT = MQDMHO_NONE
   rcc = RXMQDMH('mh1','dmho1.')
   say "DMH mh1 =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   mh1cree = 0
   /* ------------------------------------------------------------ */
   /* GET du message initial                                      */
   /* ------------------------------------------------------------ */
   cmho2.OPT = MQCMHO_VALIDATE
   rcc = RXMQMH('mh2','cmho2.')
   say "MH2 =" rcc mh2
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   mh2cree = 1
   msg2.0 = 8192
   igmd2.VER  = MQMD_VERSION_2
   igmd2.ENC  = MQENC_NATIVE
   igmd2.CCSI = MQCCSI_Q_MGR
   igmd2.FORM = MQFMT_NONE
   igmo2.VER   = MQGMO_VERSION_4
   igmo2.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT + MQGMO_FAIL_IF_QUIESCING
   igmo2.WAIT  = 5000
   igmo2.MOPT = MQMO_NONE
   igmo2.MH    = mh2
   rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
   say "GET initial =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   say "Corps initial =" msg2.1
   /* ------------------------------------------------------------ */
   /* Verification des proprietes dans MH2                         */
   /* ------------------------------------------------------------ */
   impo1.OPT    = MQIMPO_NONE
   impo1.RQENC  = MQENC_NATIVE
   impo1.RQCCSI = MQCCSI_APPL
   handleinq = 'mh2'
   say ""
   say "Proprietes apres le GET initial"
   call verifpresente 'usr.normal',MQTYPE_STRING,'normale',MQPD_NO_CONTEXT
   call verifpresente 'usr.contexte',MQTYPE_STRING,'contexte',MQPD_USER_CONTEXT
   if casok = 0 then signal nettoiecas
   /* ------------------------------------------------------------ */
   /* Deuxieme PUT : aucun Message Handle n'est fourni             */
   /* ------------------------------------------------------------ */
   msg3.1 = 'Message cree a partir du contexte du cas 'numcas
   msg3.0 = length(msg3.1)
   imd3.VER  = MQMD_VERSION_2
   imd3.REP  = MQRO_NONE
   imd3.MSG  = MQMT_DATAGRAM
   imd3.EXP  = MQEI_UNLIMITED
   imd3.FBK  = MQFB_NONE
   imd3.ENC  = MQENC_NATIVE
   imd3.CCSI = MQCCSI_Q_MGR
   imd3.FORM = MQFMT_STRING
   imd3.PRI  = MQPRI_PRIORITY_AS_Q_DEF
   imd3.PER  = MQPER_PERSISTENCE_AS_Q_DEF
   ipmo3.VER     = MQPMO_VERSION_3
 ipmo3.OPT=MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING +MQPMO_DEFAULT_CONTEXT
   ipmo3.TIME    = MQWI_UNLIMITED
   drop ipmo3.CON
   ipmo3.OMH     = 0
   ipmo3.NMH     = 0
   ipmo3.ACT     = MQACTP_NEW
   ipmo3.PL      = 0
   if modepass = 'IDENTITY' then do
ipmo3.OPT=MQPMO_NO_SYNCPOINT+MQPMO_FAIL_IF_QUIESCING+MQPMO_PASS_IDENTITY_CONTEXT
      ipmo3.CON = h1
   end
   else if modepass = 'ALL' then do
 ipmo3.OPT =MQPMO_NO_SYNCPOINT+MQPMO_FAIL_IF_QUIESCING+MQPMO_PASS_ALL_CONTEXT
      ipmo3.CON = h1
   end
   else do
 ipmo3.OPT =MQPMO_NO_SYNCPOINT+MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
 end
   say ""
   say "Deuxieme PUT"
   say "  PMO.Options =" ipmo3.OPT
   if symbol("ipmo3.CON") = "VAR" then,
      say "  PMO.Context =" ipmo3.CON
   else,
      say "  PMO.Context = non renseigne"
   rcc = RXMQPUT(h2,'msg3.','imd3.','omd3.','ipmo3.','opmo3.')
   say "PUT contexte =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      say "Le PUT a echoue. Verifier les autorisations de contexte."
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   /* ------------------------------------------------------------ */
   /* Le contexte sauvegarde dans h1 n'est plus necessaire         */
   /* ------------------------------------------------------------ */
   dmho2.OPT = MQDMHO_NONE
   rcc = RXMQDMH('mh2','dmho2.')
   say "DMH mh2 =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   mh2cree = 0
   /* ------------------------------------------------------------ */
   /* GET du message cree par le deuxieme PUT                      */
   /* ------------------------------------------------------------ */
   cmho3.OPT = MQCMHO_VALIDATE
   rcc = RXMQMH('mh3','cmho3.')
   say "MH3 =" rcc mh3
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   mh3cree = 1
   msg4.0 = 8192
   igmd4.VER  = MQMD_VERSION_2
   igmd4.ENC  = MQENC_NATIVE
   igmd4.CCSI = MQCCSI_Q_MGR
   igmd4.FORM = MQFMT_NONE
   igmo4.VER   = MQGMO_VERSION_4
   igmo4.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT + MQGMO_FAIL_IF_QUIESCING
   igmo4.WAIT  = 5000
   igmo4.MOPT = MQMO_NONE
   igmo4.MH    = mh3
   rcc = RXMQGET(h1,'msg4.','igmd4.','ogmd4.','igmo4.','ogmo4.')
   say "GET contexte =" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      casok = 0
      rcode = 8
      signal nettoiecas
   end
   say "Corps contexte =" msg4.1
   /* ------------------------------------------------------------ */
   /* Verification finale                                          */
   /* ------------------------------------------------------------ */
   handleinq = 'mh3'
   say ""
   say "Verification finale"
   say "usr.normal doit toujours etre absente"
   call verifabsente 'usr.normal'
   if modepass = 'ALL' then do
      say "usr.contexte doit etre presente"
 call verifpresente 'usr.contexte',MQTYPE_STRING,'contexte',MQPD_USER_CONTEXT
   end
   else do
      say "usr.contexte doit etre absente"
      call verifabsente 'usr.contexte'
   end
   signal nettoiecas
/* --------------------------------------------------------------- */
/* Verification d'une propriete presente                           */
/* --------------------------------------------------------------- */
verifpresente:
   parse arg nomatt,typeatt,valatt,contextatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      say "  KO : propriete attendue presente"
      casok = 0
      rcode = 8
      say "----------------------------------------------"
      return
   end
   say "  nom          =" pnameout
   say "  type         =" ptype "(attendu" typeatt")"
   say "  valeur       =" pvalue.1 "(attendue" valatt")"
   say "  PD.Context   =" pdout.CONTEXT "(attendu" contextatt")"
   say "  CopyOptions  =" pdout.COPYOPTIONS
   if ptype <> typeatt then do
      say "  KO : type inattendu"
      if firstFailure = '' then
         firstFailure = 'Type inattendu :' nomatt
      casok = 0
      rcode = 8
   end
   else if pvalue.1 <> valatt then do
      say "  KO : valeur inattendue"
      if firstFailure = '' then
         firstFailure = 'Valeur inattendue :' nomatt
      casok = 0
      rcode = 8
   end
   else if pdout.CONTEXT <> contextatt then do
      say "  KO : contexte inattendu"
      if firstFailure = '' then
         firstFailure = 'Contexte inattendu :' nomatt
      casok = 0
      rcode = 8
   end
   else
      say "  OK"
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Verification d'une propriete absente                            */
/* --------------------------------------------------------------- */
verifabsente:
   parse arg nomatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,1) = MQCC_FAILED &,
      RXMQ.LASTCC = MQCC_FAILED &,
      RXMQ.LASTAC = MQRC_PROPERTY_NOT_AVAILABLE then do
      say "  OK : propriete absente"
   end
   else do
      if word(rcc,1) <> 0 then call showerr rcc
      if firstFailure = '' then
         firstFailure = 'Propriete attendue absente :' nomatt
      if word(rcc,1) = 0 then do
         say "  KO : propriete presente"
         say "  type         =" ptype
         say "  valeur       =" pvalue.1
         say "  PD.Context   =" pdout.CONTEXT
         say "  CopyOptions  =" pdout.COPYOPTIONS
      end
      else do
         say "  KO : erreur inattendue"
         say "  retour =" rcc
      end
      casok = 0
      rcode = 8
   end
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Nettoyage du cas                                                */
/* --------------------------------------------------------------- */
nettoiecas:
   if mh3cree = 1 then do
      dmho3.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh3','dmho3.')
      say "DMH mh3 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
         casok = 0
      end
      else mh3cree = 0
   end
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
         casok = 0
      end
      else mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
         casok = 0
      end
      else mh1cree = 0
   end
   if h2ouvert = 1 then do
      rcc2 = RXMQCLOS(h2,0)
      say "CLOSE h2 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
         casok = 0
      end
      else h2ouvert = 0
   end
   if h1ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE h1 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
         casok = 0
      end
      else h1ouvert = 0
   end
   if casok = 1 then
      say "CAS" numcas "OK"
   else do
      say "CAS" numcas "KO"
      rcode = 8
   end
return
/* --------------------------------------------------------------- */
/* Nettoyage general                                               */
/* --------------------------------------------------------------- */
cleanup:
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else connecte = 0
   end
say "=============================================="
if rcode = 0 then
   say "TEST PASSED: HANDLE9"
else do
   say "TEST FAILED: HANDLE9"
   say "FIRST FAILURE =" firstFailure
end
say "=============================================="
exit rcode
showerr:
   parse arg errrcc
   if firstFailure = '' then firstFailure = errrcc
   say "LASTRC  =" RXMQ.LASTRC
   say "LASTCC  =" RXMQ.LASTCC
   say "LASTAC  =" RXMQ.LASTAC
   say "LASTMSG =" RXMQ.LASTMSG
return
