/* REXX */
/*
  * HANDLE6 - Deleting a property with MQDLTMP
 *
  * CONN
  * -> OPEN
  * -> create MH1
  * -> SETMP three properties
  * -> PUT initial
  * -> delete MH1
  * -> create MH2
  * -> GET into MH2
  * -> verify the three properties
  * -> DLTMP usr.id
  * -> verify the deletion
  * -> cleanup
 */
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
mh1cree  = 0
mh2cree  = 0
ouvert   = 0
connecte = 0
rcode    = 0
say "QMGR =" qmgr
say "QUEUE=" qname
say ""
/* --------------------------------------------------------------- */
/* 0. Initialization */
/* --------------------------------------------------------------- */
  rcc = rxmqinit()
  if word(rcc,1) /= 0      then do
   say time('l') 'initialization problem rc ==> ' rcc
   interpret 'msgerr = rxmq.rcmap.'word(rcc,1)
   say "                                           ==> "msgerr
   exit 8
   end
/* --------------------------------------------------------------- */
/* Connection */
/* --------------------------------------------------------------- */
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
connecte = 1
/* --------------------------------------------------------------- */
/* Open the queue for input and output */
/* --------------------------------------------------------------- */
iod1.OT = MQOT_Q
iod1.ON = qname
iod1.OM = ''
oo1 = MQOO_OUTPUT + MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
say "OPEN =" rcc " h1=" h1
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
ouvert = 1
/* --------------------------------------------------------------- */
/* Create message handle MH1 */
/* --------------------------------------------------------------- */
cmho1.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh1','cmho1.')
say "MH1  =" rcc mh1
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh1cree = 1
/* --------------------------------------------------------------- */
/* Define properties in MH1 */
/* --------------------------------------------------------------- */
smpo1.OPT      = MQSMPO_NONE
pd1.OPT        = MQPD_NONE
pd1.SUPPORT    = MQPD_SUPPORT_OPTIONAL
pd1.CONTEXT    = MQPD_NO_CONTEXT
pd1.COPYOPTIONS = MQCOPY_DEFAULT
rcc=RXMQSMP('mh1','smpo1.','usr.color','pd1.',MQTYPE_STRING,'blue')
say "SMP usr.color =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
rcc=RXMQSMP('mh1','smpo1.','usr.id','pd1.',MQTYPE_INT32,1234)
say "SMP usr.id      =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
rcc=RXMQSMP('mh1','smpo1.','usr.client','pd1.',MQTYPE_STRING,'IBM')
say "SMP usr.client  =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Initial message body */
/* --------------------------------------------------------------- */
d.1 = 'Initial message for the MQDLTMP'
d.0 = length(d.1)
/* --------------------------------------------------------------- */
/* MQMD for the PUT */
/* --------------------------------------------------------------- */
imd2.VER  = MQMD_VERSION_2
imd2.REP  = MQRO_NONE
imd2.MSG  = MQMT_DATAGRAM
imd2.EXP  = MQEI_UNLIMITED
imd2.FBK  = MQFB_NONE
imd2.ENC  = MQENC_NATIVE
imd2.CCSI = MQCCSI_Q_MGR
imd2.FORM = MQFMT_STRING
imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
/* --------------------------------------------------------------- */
/* PUT the message with the properties from MH1 */
/* --------------------------------------------------------------- */
ipmo2.VER     = MQPMO_VERSION_3
ipmo2.OPT  = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
ipmo2.TIME    = MQWI_UNLIMITED
ipmo2.OMH     = 0
ipmo2.NMH     = mh1
ipmo2.ACT     = MQACTP_NEW
ipmo2.PL      = 0
rcc = RXMQPUT(h1,'d.','imd2.','omd2.','ipmo2.','opmo2.')
say "PUT initial =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Delete MH1 */
/* --------------------------------------------------------------- */
dmho1.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh1','dmho1.')
say "DMH mh1 =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh1cree = 0
/* --------------------------------------------------------------- */
/* Create MH2 for the GET */
/* --------------------------------------------------------------- */
cmho2.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh2','cmho2.')
say "MH2  =" rcc mh2
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
mh2cree = 1
/* --------------------------------------------------------------- */
/* GET the message */
/* --------------------------------------------------------------- */
msg2.0 = 8192
igmd2.VER  = MQMD_VERSION_2
igmd2.ENC  = MQENC_NATIVE
igmd2.CCSI = MQCCSI_Q_MGR
igmd2.FORM = MQFMT_NONE
igmo2.VER   = MQGMO_VERSION_4
igmo2.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT +,
               MQGMO_FAIL_IF_QUIESCING
igmo2.WAIT  = 5000
igmo2.MOPT  = MQMO_NONE
igmo2.MH    = mh2
rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
say "GET initial =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
say "Received body =" msg2.1
say ""
/* --------------------------------------------------------------- */
/* MQINQMP options */
/* --------------------------------------------------------------- */
impo1.OPT    = MQIMPO_NONE
impo1.RQENC  = MQENC_NATIVE
impo1.RQCCSI = MQCCSI_APPL
handleinq = 'mh2'
/* --------------------------------------------------------------- */
/* Verification before MQDLTMP */
/* --------------------------------------------------------------- */
say "=============================================="
say "PROPERTIES BEFORE MQDLTMP"
say "=============================================="
say ""
call verifpresente 'usr.color',MQTYPE_STRING,'blue'
call verifpresente 'usr.id',MQTYPE_INT32,'1234'
call verifpresente 'usr.client',MQTYPE_STRING,'IBM'
if rcode <> 0 then signal cleanup
/* --------------------------------------------------------------- */
/* Delete usr.id from MH2 */
/* --------------------------------------------------------------- */
dmpo1.OPT = MQDMPO_NONE
say ""
say "=============================================="
say "DELETE usr.id"
say "=============================================="
rcc=RXMQDMP('mh2','dmpo1.','usr.id')
say "DMP usr.id =" rcc
if word(rcc,1) <> 0 then do
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Verification after MQDLTMP */
/* --------------------------------------------------------------- */
say ""
say "=============================================="
say "PROPERTIES AFTER MQDLTMP"
say "=============================================="
say ""
call verifpresente 'usr.color',MQTYPE_STRING,'blue'
call verifabsente 'usr.id'
call verifpresente 'usr.client',MQTYPE_STRING,'IBM'
/* --------------------------------------------------------------- */
/* Summary */
/* --------------------------------------------------------------- */
say ""
if rcode = 0 then do
   say "=============================================="
   say "TEST PASSED: MQDLTMP"
   say "=============================================="
end
else do
   say "=============================================="
   say "TEST FAILED: MQDLTMP"
   say "=============================================="
end
signal cleanup
/* --------------------------------------------------------------- */
/* Verify a property that is expected to be present */
/* --------------------------------------------------------------- */
verifpresente:
   parse arg nomatt,typeatt,valatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "Verifying" nomatt
   say "  Expected result = PRESENT"
   say "  IMP              =" rcc
   if word(rcc,1) <> 0 then do
      say "  Actual result   = ABSENT OR ERROR"
      say "  FAILED: expected property is present"
      rcode = 8
      say "----------------------------------------------"
      return
   end
   say "  Returned name     =" pnameout
   say "  Returned type    =" ptype
   say "  Expected type     =" typeatt
   say "  Returned value =" pvalue.1
   say "  Expected value  =" valatt
   if ptype <> typeatt then do
      say "  FAILED: unexpected type"
      rcode = 8
   end
   else if pvalue.1 <> valatt then do
      say "  FAILED: unexpected value"
      rcode = 8
   end
   else
      say "  OK: property is present"
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Verify a property that is expected to be absent */
/* --------------------------------------------------------------- */
verifabsente:
   parse arg nomatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "Verifying" nomatt
   say "  Expected result = ABSENT"
   say "  IMP              =" rcc
   if word(rcc,3) = MQRC_PROPERTY_NOT_AVAILABLE then do
      say "  Actual result   = ABSENT"
      say "  OK: property was deleted"
   end
   else do
      if word(rcc,1) = 0 then do
         say "  Actual result   = PRESENT"
         say "  Type             =" ptype
         say "  Value             =" pvalue.1
         say "  FAILED: property is still present"
      end
      else do
         say "  Actual result   = UNEXPECTED ERROR"
         say "  FAILED: unexpected return"
      end
      rcode = 8
   end
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Single cleanup path */
/* --------------------------------------------------------------- */
cleanup:
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      mh1cree = 0
   end
   if ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE =" rcc2
      ouvert = 0
   end
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC  =" rcc2
      connecte = 0
   end
exit rcode
