/* REXX */
/*
RXMQVTRACE = 'CONN OPEN PUT GET CLOSE DISC MH SMP IMP DMH'
*/
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
mh1cree  = 0
mh2cree  = 0
ouvert   = 0
connecte = 0
rcode    = 0
firstFailure = ''
say "QMGR =" qmgr
say "QUEUE=" qname
rcc = RXMQCONS()
say "CONS =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
connecte = 1
iod1.OT = MQOT_Q
iod1.ON = qname
iod1.OQM = ''
oo1 = MQOO_OUTPUT + MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
say "OPEN =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
ouvert = 1
say "h1         =" h1
say "OOD1.ZLIST =" ood1.ZLIST
say "OOD1.RQN   =" ood1.RQN
say "OOD1.RQMN  =" ood1.RQMN
cmho1.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh1','cmho1.')
say "MH1 =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
mh1cree = 1
say "mh1 =" mh1
smpo1.OPT       = MQSMPO_NONE
pd1.OPT         = MQPD_NONE
pd1.SUPPORT     = MQPD_SUPPORT_OPTIONAL
pd1.CONTEXT     = MQPD_NO_CONTEXT
pd1.COPYOPTIONS = MQCOPY_DEFAULT
rcc = RXMQSMP('mh1','smpo1.','usr.couleur','pd1.',  ,
              MQTYPE_STRING,'rouge')
say "SMP =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
d.1 = 'hello'
d.0 = length(d.1)
imd2.VER  = MQMD_VERSION_2
imd2.REP  = MQRO_NONE
imd2.MSG  = MQMT_DATAGRAM
imd2.EXP  = MQEI_UNLIMITED
imd2.FBK  = MQFB_NONE
imd2.ENC  = MQENC_NATIVE
imd2.CCSI = MQCCSI_Q_MGR
imd2.FORM = MQFMT_STRING
imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
ipmo2.VER  = MQPMO_VERSION_3
ipmo2.OPT  = MQPMO_NO_SYNCPOINT +,
             MQPMO_FAIL_IF_QUIESCING +,
             MQPMO_DEFAULT_CONTEXT
ipmo2.TIME = MQWI_UNLIMITED
ipmo2.CON  = 0
ipmo2.OMH  = 0
ipmo2.NMH  = mh1
ipmo2.ACT  = MQACTP_NEW
ipmo2.PL   = 0
rcc = RXMQPUT(h1,'d.','imd2.','omd2.','ipmo2.','opmo2.')
say "PUT =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
dmho1.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh1','dmho1.')
say "DMH mh1 =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
mh1cree = 0
cmho2.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh2','cmho2.')
say "MH2 =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
mh2cree = 1
say "mh2 =" mh2
msg2.0 = 8192
igmd2.VER  = MQMD_VERSION_2
igmd2.ENC  = MQENC_NATIVE
igmd2.CCSI = MQCCSI_Q_MGR
igmd2.FORM = MQFMT_NONE
igmo2.VER  = MQGMO_VERSION_4
igmo2.OPT  = MQGMO_NO_SYNCPOINT +,
             MQGMO_WAIT +,
             MQGMO_FAIL_IF_QUIESCING
igmo2.WAIT = 5000
igmo2.MOPT = MQMO_NONE
igmo2.MH   = mh2
rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
say "GET =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
say "msg2.0         =" msg2.0
say "length(msg2.1) =" length(msg2.1)
say "msg2.1         =" msg2.1
if msg2.0 <> length(d.1) |,
   length(msg2.1) <> length(d.1) |,
   msg2.1 <> d.1 then do
  say "FAILED: unexpected message body"
  if firstFailure = '' then firstFailure = 'Unexpected message body'
  rcode = 8
  signal cleanup
end
impo1.OPT    = MQIMPO_NONE
impo1.RQENC  = MQENC_NATIVE
impo1.RQCCSI = MQCCSI_APPL
pnam     = 'usr.couleur'
pvalue.0 = 4096
pvalue.1 = ''
ptype    = ''
pnameout = ''
rcc = RXMQIMP('mh2',,
              'impo1.',,
              pnam,,
              'pdout.',,
              'ptype',,
              'pvalue.',,
              'pnameout')
say "IMP =" rcc
if word(rcc,1) <> 0 then do
  call showerr rcc
  rcode = 8
  signal cleanup
end
say "ptype    =" ptype
say "pvalue.0 =" pvalue.0
say "pvalue.1 =" pvalue.1
say "pnameout =" pnameout
if ptype <> MQTYPE_STRING then do
  say "FAILED: unexpected property type"
  if firstFailure = '' then firstFailure = 'Unexpected property type'
  rcode = 8
end
if pvalue.0 <> length('rouge') |,
   length(pvalue.1) <> length('rouge') |,
   pvalue.1 <> 'rouge' then do
  say "FAILED: unexpected property value"
  if firstFailure = '' then firstFailure = 'Unexpected property value'
  rcode = 8
end
cleanup:
if mh2cree = 1 then do
  dmho2.OPT = MQDMHO_NONE
  rcc2 = RXMQDMH('mh2','dmho2.')
  say "DMH mh2 =" rcc2
  if word(rcc2,1) <> 0 then do
    call showerr rcc2
    rcode = 8
  end
  else mh2cree = 0
end
if mh1cree = 1 then do
  dmho1.OPT = MQDMHO_NONE
  rcc2 = RXMQDMH('mh1','dmho1.')
  say "DMH mh1 =" rcc2
  if word(rcc2,1) <> 0 then do
    call showerr rcc2
    rcode = 8
  end
  else mh1cree = 0
end
if ouvert = 1 then do
  rcc2 = RXMQCLOS(h1,MQCO_NONE)
  say "CLOSE =" rcc2
  if word(rcc2,1) <> 0 then do
    call showerr rcc2
    rcode = 8
  end
  else ouvert = 0
end
if connecte = 1 then do
  rcc2 = RXMQDISC()
  say "DISC =" rcc2
  if word(rcc2,1) <> 0 then do
    call showerr rcc2
    rcode = 8
  end
  else connecte = 0
end
say "=============================================="
if rcode = 0 then do
  say "TEST PASSED: HANDLE1"
  say "usr.couleur = rouge"
end
else do
  say "TEST FAILED: HANDLE1"
  say "FIRST FAILURE =" firstFailure
end
say "=============================================="
exit rcode
showerr:
  parse arg errrcc
  if firstFailure = '' then firstFailure = errrcc
  say "LASTRC  =" RXMQ.LASTRC
  say "LASTCC  =" RXMQ.LASTCC
  say "LASTAC  =" RXMQ.LASTAC
  say "LASTMSG =" RXMQ.LASTMSG
return
