/* REXX */
/*
 * HANDLE5 - Copie des proprietes avec MQACTP_FORWARD
 *
 * Structure reprise de HANDLE4 :
 *
 *   CONN
 *   -> OPEN
 *   -> creation MH1
 *   -> SETMP
 *   -> PUT initial
 *   -> creation MH2
 *   -> GET initial
 *   -> creation MH3
 *   -> PUT FORWARD avec OMH=MH2 et NMH=MH3
 *   -> creation MH4
 *   -> GET du message forwarde
 *   -> INQMP
 *   -> nettoyage
 *
 * RXMQVTRACE = 'CONN OPEN PUT GET CLOSE DISC MH SMP IMP DMH'
 */
TRACE o
qmgr  = 'QM1'
qname = 'DEV.QUEUE.1'
mh1cree  = 0
mh2cree  = 0
mh3cree  = 0
mh4cree  = 0
ouvert   = 0
connecte = 0
rcode    = 0
firstFailure = ''
say "QMGR =" qmgr
say "QUEUE=" qname
say ""
/* --------------------------------------------------------------- */
/* 0. Initialisation                                              */
/* --------------------------------------------------------------- */
  rcc = rxmqinit()
  if word(rcc,1) /= 0      then do
   say time('l') 'probleme initialisation rc ==> ' rcc
   call showerr rcc
   rcode = 8
   signal cleanup
   end
/* --------------------------------------------------------------- */
/* Connexion                                                       */
/* --------------------------------------------------------------- */
rcc = RXMQCONN(qmgr)
say "CONN =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
connecte = 1
/* --------------------------------------------------------------- */
/* Ouverture de la file en entree et en sortie                     */
/* --------------------------------------------------------------- */
iod1.OT = MQOT_Q
iod1.ON = qname
iod1.OQM = ''
oo1 = MQOO_OUTPUT + MQOO_INPUT_SHARED + MQOO_FAIL_IF_QUIESCING
rcc = RXMQOPEN('iod1.',oo1,'h1','ood1.')
say "OPEN =" rcc " h1=" h1
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
ouvert = 1
/* --------------------------------------------------------------- */
/* Creation du message handle source MH1                           */
/* --------------------------------------------------------------- */
cmho1.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh1','cmho1.')
say "MH1  =" rcc mh1
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh1cree = 1
/* --------------------------------------------------------------- */
/* Descripteur commun aux proprietes                               */
/* --------------------------------------------------------------- */
smpo1.OPT   = MQSMPO_NONE
pd1.OPT     = MQPD_NONE
pd1.SUPPORT = MQPD_SUPPORT_OPTIONAL
pd1.CONTEXT = MQPD_NO_CONTEXT
/* --------------------------------------------------------------- */
/* Propriete avec MQCOPY_DEFAULT                                   */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_DEFAULT
rcc=RXMQSMP('mh1','smpo1.','usr.defaut','pd1.',MQTYPE_STRING,'bleu')
say "SMP usr.defaut       MQCOPY_DEFAULT =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Propriete avec MQCOPY_FORWARD                                   */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_FORWARD
rcc=RXMQSMP('mh1','smpo1.','usr.forward','pd1.',MQTYPE_INT32,25)
say "SMP usr.forward      MQCOPY_FORWARD =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Propriete avec MQCOPY_REPLY                                     */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_REPLY
rcc=RXMQSMP('mh1','smpo1.','usr.reply','pd1.',MQTYPE_BOOLEAN,1)
say "SMP usr.reply        MQCOPY_REPLY =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Propriete avec MQCOPY_FORWARD et MQCOPY_REPLY                   */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_FORWARD + MQCOPY_REPLY
rcc=RXMQSMP('mh1','smpo1.','usr.forwrep','pd1.',MQTYPE_FLOAT64,123.45)
say "SMP usr.forwrep      FORWARD + REPLY =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Propriete avec MQCOPY_ALL                                       */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_ALL
rcc=RXMQSMP('mh1','smpo1.','usr.toujours','pd1.',MQTYPE_INT64,5000000000)
say "SMP usr.toujours     MQCOPY_ALL =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Propriete avec MQCOPY_NONE                                      */
/* --------------------------------------------------------------- */
pd1.COPYOPTIONS = MQCOPY_NONE
rcc=RXMQSMP('mh1','smpo1.','usr.jamais','pd1.',MQTYPE_FLOAT32,12.5)
say "SMP usr.jamais       MQCOPY_NONE =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Corps du message initial                                       */
/* --------------------------------------------------------------- */
d.1 = 'Message initial pour le test MQACTP_FORWARD'
d.0 = length(d.1)
/* MQMD du premier PUT */
imd2.VER  = MQMD_VERSION_2
imd2.REP  = MQRO_NONE
imd2.MSG  = MQMT_DATAGRAM
imd2.EXP  = MQEI_UNLIMITED
imd2.FBK  = MQFB_NONE
imd2.ENC  = MQENC_NATIVE
imd2.CCSI = MQCCSI_Q_MGR
imd2.FORM = MQFMT_STRING
imd2.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd2.PER  = MQPER_PERSISTENCE_AS_Q_DEF
/* --------------------------------------------------------------- */
/* Premier PUT : nouveau message avec les proprietes de MH1        */
/* --------------------------------------------------------------- */
ipmo2.VER     = MQPMO_VERSION_3
ipmo2.OPT = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
ipmo2.TIME    = MQWI_UNLIMITED
ipmo2.OMH     = 0
ipmo2.NMH     = mh1
ipmo2.ACT     = MQACTP_NEW
ipmo2.PL      = 0
rcc = RXMQPUT(h1,'d.','imd2.','omd2.','ipmo2.','opmo2.')
say "PUT initial =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Suppression de MH1                                              */
/* --------------------------------------------------------------- */
dmho1.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh1','dmho1.')
say "DMH mh1 =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh1cree = 0
/* --------------------------------------------------------------- */
/* Creation du message handle MH2 pour le premier GET              */
/* --------------------------------------------------------------- */
cmho2.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh2','cmho2.')
say "MH2  =" rcc mh2
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh2cree = 1
/* --------------------------------------------------------------- */
/* GET du message initial                                         */
/* --------------------------------------------------------------- */
msg2.0 = 8192
igmd2.VER  = MQMD_VERSION_2
igmd2.ENC  = MQENC_NATIVE
igmd2.CCSI = MQCCSI_Q_MGR
igmd2.FORM = MQFMT_NONE
igmo2.VER   = MQGMO_VERSION_4
igmo2.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT +,
               MQGMO_FAIL_IF_QUIESCING
igmo2.WAIT  = 5000
igmo2.MOPT  = MQMO_NONE
igmo2.MH    = mh2
rcc = RXMQGET(h1,'msg2.','igmd2.','ogmd2.','igmo2.','ogmo2.')
say "GET initial =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "Corps initial =" msg2.1
say ""
/* --------------------------------------------------------------- */
/* Verification des proprietes presentes dans MH2                 */
/* avant le PUT FORWARD                                            */
/* --------------------------------------------------------------- */
impo1.OPT    = MQIMPO_NONE + MQIMPO_CONVERT_VALUE
impo1.RQENC  = MQENC_INTEGER_NORMAL + MQENC_DECIMAL_NORMAL +,
                MQENC_FLOAT_IEEE_NORMAL
impo1.RQCCSI = MQCCSI_APPL
say "Verification des proprietes avant le FORWARD"
say ""
handleinq = 'mh2'
call verifpresente 'usr.defaut',MQTYPE_STRING,'bleu'
call verifpresente 'usr.forward',MQTYPE_INT32,'25'
call verifpresente 'usr.reply',MQTYPE_BOOLEAN,'1'
call verifpresente 'usr.forwrep',MQTYPE_FLOAT64,'123.45'
call verifpresente 'usr.toujours',MQTYPE_INT64,'5000000000'
call verifpresente 'usr.jamais',MQTYPE_FLOAT32,'12.5'
if rcode <> 0 then signal cleanup
/* --------------------------------------------------------------- */
/* Creation de MH3 : NewMsgHandle du PUT FORWARD                   */
/* --------------------------------------------------------------- */
cmho3.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh3','cmho3.')
say "MH3  =" rcc mh3
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh3cree = 1
/* --------------------------------------------------------------- */
/* Deuxieme PUT avec MQACTP_FORWARD                                */
/*                                                               */
/* MH2 est le handle du message original.                          */
/* MH3 est le handle du nouveau message.                           */
/* MQ copie de MH2 vers MH3 selon MQPD.CopyOptions.                */
/* --------------------------------------------------------------- */
msgf.1 = msg2.1
msgf.0 = length(msgf.1)
imd3.VER  = MQMD_VERSION_2
imd3.REP  = MQRO_NONE
imd3.MSG  = MQMT_DATAGRAM
imd3.EXP  = MQEI_UNLIMITED
imd3.FBK  = MQFB_NONE
imd3.ENC  = MQENC_NATIVE
imd3.CCSI = MQCCSI_Q_MGR
imd3.FORM = MQFMT_STRING
imd3.PRI  = MQPRI_PRIORITY_AS_Q_DEF
imd3.PER  = MQPER_PERSISTENCE_AS_Q_DEF
ipmo3.VER     = MQPMO_VERSION_3
ipmo3.OPT = MQPMO_NO_SYNCPOINT + MQPMO_FAIL_IF_QUIESCING+MQPMO_DEFAULT_CONTEXT
ipmo3.TIME    = MQWI_UNLIMITED
ipmo3.OMH     = mh2
ipmo3.NMH     = mh3
ipmo3.ACT     = MQACTP_FORWARD
ipmo3.PL      = 0
say ""
say "PUT FORWARD"
say "  OriginalMsgHandle =" ipmo3.OMH
say "  NewMsgHandle      =" ipmo3.NMH
say "  Action            =" ipmo3.ACT
rcc = RXMQPUT(h1,'msgf.','imd3.','omd3.','ipmo3.','opmo3.')
say "PUT forward =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
/* --------------------------------------------------------------- */
/* Suppression des handles utilises par le PUT FORWARD             */
/* --------------------------------------------------------------- */
dmho2.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh2','dmho2.')
say "DMH mh2 =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh2cree = 0
dmho3.OPT = MQDMHO_NONE
rcc = RXMQDMH('mh3','dmho3.')
say "DMH mh3 =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh3cree = 0
/* --------------------------------------------------------------- */
/* Creation de MH4 pour recevoir le message forwarde               */
/* --------------------------------------------------------------- */
cmho4.OPT = MQCMHO_VALIDATE
rcc = RXMQMH('mh4','cmho4.')
say "MH4  =" rcc mh4
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
mh4cree = 1
/* --------------------------------------------------------------- */
/* GET du message forwarde                                        */
/* --------------------------------------------------------------- */
msg4.0 = 8192
igmd4.VER  = MQMD_VERSION_2
igmd4.ENC  = MQENC_NATIVE
igmd4.CCSI = MQCCSI_Q_MGR
igmd4.FORM = MQFMT_NONE
igmo4.VER   = MQGMO_VERSION_4
igmo4.OPT   = MQGMO_NO_SYNCPOINT + MQGMO_WAIT +,
               MQGMO_FAIL_IF_QUIESCING
igmo4.WAIT  = 5000
igmo4.MOPT  = MQMO_NONE
igmo4.MH    = mh4
rcc = RXMQGET(h1,'msg4.','igmd4.','ogmd4.','igmo4.','ogmo4.')
say "GET forward =" rcc
if word(rcc,1) <> 0 then do
   call showerr rcc
   rcode = 8
   signal cleanup
end
say "Corps forward =" msg4.1
say ""
/* --------------------------------------------------------------- */
/* Verification des proprietes apres MQACTP_FORWARD                */
/* --------------------------------------------------------------- */
say "Verification des proprietes apres MQACTP_FORWARD"
say ""
handleinq = 'mh4'
say "MQCOPY_DEFAULT : propriete attendue presente"
call verifpresente 'usr.defaut',MQTYPE_STRING,'bleu'
say "MQCOPY_FORWARD : propriete attendue presente"
call verifpresente 'usr.forward',MQTYPE_INT32,'25'
say "MQCOPY_REPLY : propriete attendue absente"
call verifabsente 'usr.reply'
say "MQCOPY_FORWARD + MQCOPY_REPLY : propriete attendue presente"
call verifpresente 'usr.forwrep',MQTYPE_FLOAT64,'123.45'
say "MQCOPY_ALL : propriete attendue presente"
call verifpresente 'usr.toujours',MQTYPE_INT64,'5000000000'
say "MQCOPY_NONE : propriete attendue absente"
call verifabsente 'usr.jamais'
/* --------------------------------------------------------------- */
/* Bilan                                                           */
/* --------------------------------------------------------------- */
say ""
signal cleanup
/* --------------------------------------------------------------- */
/* Verification d'une propriete attendue presente                  */
/* --------------------------------------------------------------- */
verifpresente:
   parse arg nomatt,typeatt,valatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,1) <> 0 then do
      call showerr rcc
      say "  KO : propriete attendue presente"
      rcode = 8
      say "----------------------------------------------"
      return
   end
   say "  nom      =" pnameout
   say "  type     =" ptype "(attendu" typeatt")"
   say "  longueur =" pvalue.0
   say "  valeur   =" pvalue.1 "(attendue" valatt")"
   if ptype <> typeatt then do
      say "  KO : type inattendu"
      if firstFailure = '' then
         firstFailure = 'Type inattendu :' nomatt
      rcode = 8
   end
   else if pvalue.1 <> valatt then do
      if typeatt = MQTYPE_FLOAT32 then do
         if pvalue.1 = valatt + 0 then
            say "  OK : valeur numerique equivalente"
         else do
            say "  KO : valeur inattendue"
            if firstFailure = '' then
               firstFailure = 'Valeur inattendue :' nomatt
            rcode = 8
         end
      end
      else if typeatt = MQTYPE_FLOAT64 then do
         if pvalue.1 = valatt + 0 then
            say "  OK : valeur numerique equivalente"
         else do
            say "  KO : valeur inattendue"
            if firstFailure = '' then
               firstFailure = 'Valeur inattendue :' nomatt
            rcode = 8
         end
      end
      else do
         say "  KO : valeur inattendue"
         if firstFailure = '' then
            firstFailure = 'Valeur inattendue :' nomatt
         rcode = 8
      end
   end
   else
      say "  OK"
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Verification d'une propriete attendue absente                   */
/* --------------------------------------------------------------- */
verifabsente:
   parse arg nomatt
   pvalue.0 = 4096
   pvalue.1 = ''
   pnameout = ''
   ptype    = ''
   rcc=RXMQIMP(handleinq,'impo1.',nomatt,'pdout.','ptype','pvalue.','pnameout')
   say "IMP" nomatt "=" rcc
   if word(rcc,1) = MQCC_FAILED &,
      RXMQ.LASTCC = MQCC_FAILED &,
      RXMQ.LASTAC = MQRC_PROPERTY_NOT_AVAILABLE then do
      say "  OK : propriete absente"
   end
   else do
      if word(rcc,1) <> 0 then call showerr rcc
      if firstFailure = '' then
         firstFailure = 'Propriete attendue absente :' nomatt
      if word(rcc,1) = 0 then do
         say "  KO : propriete presente"
         say "  type   =" ptype
         say "  valeur =" pvalue.1
      end
      else do
         say "  KO : erreur inattendue"
         say "  retour =" rcc
      end
      rcode = 8
   end
   say "----------------------------------------------"
return
/* --------------------------------------------------------------- */
/* Nettoyage unique                                                */
/* --------------------------------------------------------------- */
cleanup:
   if mh4cree = 1 then do
      dmho4.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh4','dmho4.')
      say "DMH mh4 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh4cree = 0
   end
   if mh3cree = 1 then do
      dmho3.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh3','dmho3.')
      say "DMH mh3 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh3cree = 0
   end
   if mh2cree = 1 then do
      dmho2.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh2','dmho2.')
      say "DMH mh2 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh2cree = 0
   end
   if mh1cree = 1 then do
      dmho1.OPT = MQDMHO_NONE
      rcc2 = RXMQDMH('mh1','dmho1.')
      say "DMH mh1 =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else mh1cree = 0
   end
   if ouvert = 1 then do
      rcc2 = RXMQCLOS(h1,0)
      say "CLOSE =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else ouvert = 0
   end
   if connecte = 1 then do
      rcc2 = RXMQDISC()
      say "DISC =" rcc2
      if word(rcc2,1) <> 0 then do
         call showerr rcc2
         rcode = 8
      end
      else connecte = 0
   end
say "=============================================="
if rcode = 0 then
   say "TEST PASSED: HANDLE5"
else do
   say "TEST FAILED: HANDLE5"
   say "FIRST FAILURE =" firstFailure
end
say "=============================================="
exit rcode
showerr:
   parse arg errrcc
   if firstFailure = '' then firstFailure = errrcc
   say "LASTRC  =" RXMQ.LASTRC
   say "LASTCC  =" RXMQ.LASTCC
   say "LASTAC  =" RXMQ.LASTAC
   say "LASTMSG =" RXMQ.LASTMSG
return
