IRXFUSER TITLE 'USER REXX FUNCTION PACKAGE DIRECTORY'
***********************************************************************
* WebSphere MQ Support Pac MA95 - REXX support for z/OS and Windows   *
* (C) Copyright IBM Corporation 2009                                  *
***********************************************************************
***********************************************************************
* !!!!!!!! Use Assembler BATCH option for this file !!!!!!!!!!!!!!!!! *
***********************************************************************
IRXFUSER CSECT
IRXFUSER AMODE 31
IRXFUSER RMODE ANY
HEADER   DC    CL8'IRXFPACK'       STRING IDENTIFYING DIRECTORY
         DC    A(ENTRIES-HEADER)   LENGTH OF HEADER
         DC    A((END-ENTRIES)/32) NUMBER OF ROWS IN DIRECTORY
         DC    F'0'                WORD OF ZEROS
         DC    A(FPCKDIR_NEXT-FPCKDIR_ENTRY)  LENGTH OF DIRECTORY ENTRY
*
ENTRIES  EQU   *
*
         DC    CL8'RXMQINIT'    Name used in EXEC
         DC    V(RXMQINIT)      Address of preloaded code
         DC    F'0'             Reserved
         DC    CL8' '           Name of entry point
         DC    CL8' '           DD from which to load entry point
*
         DC    CL8'RXMQTERM'
         DC    V(RXMQTERM)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQCONS'
         DC    V(RXMQCONS)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQCONN'
         DC    V(RXMQCONN)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQOPEN'
         DC    V(RXMQOPEN)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQCLOS'
         DC    V(RXMQCLOS)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQDISC'
         DC    V(RXMQDISC)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQCMIT'
         DC    V(RXMQCMIT)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQBACK'
         DC    V(RXMQBACK)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQPUT '
         DC    V(RXMQPUT)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQPUT1'
         DC    V(RXMQPUT1)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQGET '
         DC    V(RXMQGET)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQINQ '
         DC    V(RXMQINQ)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQSET '
         DC    V(RXMQSET)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQSUB '
         DC    V(RXMQSUB)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQBRWS'
         DC    V(RXMQBRWS)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQHXT '
         DC    V(RXMQHXT)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQEVNT'
         DC    V(RXMQEVNT)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQTM  '
         DC    V(RXMQTM)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQC   '
         DC    V(RXMQC)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQV  '
         DC    V(RXMQV)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQVC  '
         DC    V(RXMQVC)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQMH  '
         DC    V(RXMQMH)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQDMH '
         DC    V(RXMQDMH)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQSMP '
         DC    V(RXMQSMP)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQIMP '
         DC    V(RXMQIMP)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQDMP '
         DC    V(RXMQDMP)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQBMH '
         DC    V(RXMQBMH)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
         DC    CL8'RXMQMBF '
         DC    V(RXMQMBF)
         DC    F'0'
         DC    CL8' '
         DC    CL8' '
*
END      EQU   *
*
         IRXFPDIR       REXX function package mapping macro
         END   IRXFUSER
***********************************************************************
*        Collection of C++ stubs for MQ API calls                     *
***********************************************************************
CCSTUBS  TITLE 'C++ program call stubs'
CCSTUBS  CSECT
CCSTUBS  AMODE 31
CCSTUBS  RMODE ANY
         ENTRY SAVEEB
         ENTRY RXMQINIT
         ENTRY RXMQTERM
         ENTRY RXMQCONS
         ENTRY RXMQCONN
         ENTRY RXMQOPEN
         ENTRY RXMQCLOS
         ENTRY RXMQDISC
         ENTRY RXMQCMIT
         ENTRY RXMQBACK
         ENTRY RXMQPUT
         ENTRY RXMQPUT1
         ENTRY RXMQGET
         ENTRY RXMQINQ
         ENTRY RXMQSET
         ENTRY RXMQSUB
         ENTRY RXMQBRWS
         ENTRY RXMQHXT
         ENTRY RXMQEVNT
         ENTRY RXMQTM
         ENTRY RXMQC
         ENTRY RXMQV
         ENTRY RXMQVC
         ENTRY RXMQMH
         ENTRY RXMQDMH
         ENTRY RXMQSMP
         ENTRY RXMQIMP
         ENTRY RXMQDMP
         ENTRY RXMQBMH
         ENTRY RXMQMBF
RXMQINIT J     CCENTRY
RXMQTERM J     CCENTRY
RXMQCONS J     CCENTRY
RXMQCONN J     CCENTRY
RXMQOPEN J     CCENTRY
RXMQCLOS J     CCENTRY
RXMQDISC J     CCENTRY
RXMQCMIT J     CCENTRY
RXMQBACK J     CCENTRY
RXMQPUT  J     CCENTRY
RXMQPUT1 J     CCENTRY
RXMQGET  J     CCENTRY
RXMQINQ  J     CCENTRY
RXMQSET  J     CCENTRY
RXMQSUB  J     CCENTRY
RXMQBRWS J     CCENTRY
RXMQHXT  J     CCENTRY
RXMQEVNT J     CCENTRY
RXMQTM   J     CCENTRY
RXMQC    J     CCENTRY
RXMQV    J     CCENTRY
RXMQVC   J     CCENTRY
RXMQMH   J     CCENTRY
RXMQDMH  J     CCENTRY
RXMQSMP  J     CCENTRY
RXMQIMP  J     CCENTRY
RXMQDMP  J     CCENTRY
RXMQBMH  J     CCENTRY
RXMQMBF  J     CCENTRY
*
CCENTRY  STM   14,12,12(13)  Save caller's registers
         CNOP  0,4           Ensure no gaps after JAS
         JAS   12,*+8        Branch around constant
         DC    A(CCSTUBS)    à CSECT
         L     12,0(,12)     Load à CSECT
         USING CCSTUBS,12
         LA    15,0(,15)     Get rid of high order bit
         SR    15,12         Called entry offset
         SRL   15,2          Called entry index
         ST    15,PTBINDEX   Save for later router call
*
         LA    15,CCSAVE     à of new savearea
         ST    13,4(15)      Back-chain the save area
         ST    15,8(13)      Forward-chain in caller's save area
         LR    13,15         R13 = à current save area
*---------------------------------------------------------------------*
*        Now try to retrieve TCB-related user token.                  *
*        If it doesn't exist, init C++ environment and create it.     *
*        If exists, use already created C++ environment.              *
*---------------------------------------------------------------------*
         CALL  IEANTRT,(LEVEL,USERNAME,USERTOK,RETCODE)
         LA    2,IEANT_OK    Make 0 for comparison
         C     2,RETCODE     Was environment initialized previously ?
         JE    CSUB          Yes
         LA    2,IEANT_NOT_FOUND
         C     2,RETCODE     Not initialized ?
         JE    LOADPIPI      Go, init
         ABEND (2),DUMP
*
LOADPIPI LOAD  EP=RXMQINIT   Load myself to make us resident
*
         LOAD  EP=CEEPIPI    Load CEEPIPI routine dynamically
         ST    0,CCINIPTR    Save CEEPIPI address
*
         LR    15,0          Get CEEPIPI address
         LA    1,INITPL      à INIT plist for CEEPIPI
         BALR  14,15         Invoke CEEPIPI INIT
         LTR   2,15          Check return code
         JZ    CRETOK        If zero, create user token
         ABEND (2),DUMP      Abend with bad RC and dump memory
*
CRETOK   DS    0H
         CALL  IEANTCR,(LEVEL,USERNAME,USERTOK,PERSOPT,RETCODE)
         LA    2,IEANT_OK    Make 0 for comparison
         C     2,RETCODE     Was create successful ?
         JE    CSUB          Yes
         ABEND (2),DUMP
*
CSUB     DS    0H
*---------------------------------------------------------------------*
*        All REXX external functions have the following regs passed:  *
*        R0 = à Environment Block                                     *
*        R1 = à External Function Parameter List                      *
*                                                                     *
*        à envblock is saved for later calls to REXX services         *
*        It is not passed to C++ routines                             *
*                                                                     *
*        efpl content is used to create C++ plist in the form:        *
*        RXMQ... (PSZ       afuncname,  // ptr to REXX func name      *
*                 LONG      aargc,      // number of parms            *
*                 RXSTRING  aargv  ,    // parms                      *
*                 PSZ       aqname,     // REXX queue name            *
*                 PRXSTRING aretstr)    // return string              *
*        afuncname & aqname are currently not used                    *
*                                                                     *
*---------------------------------------------------------------------*
         L     1,4(,13)                à previous savearea
         L     0,20(,1)                REXX R0 = à envblock
         ST    0,SAVEEB                save à envblock for REXX srvc
*
         L     15,PTBINDEX             entry index
         SLL   15,4                    * 16 = entry length
         LA    15,PPTBL+24(15)         à entry name
         MVC   FUNCNAME(8),0(15)       -> C++ plist
*
         L     1,24(,1)                REXX R1 = à efpl
         USING EFPL,1
         L     15,EFPLEVAL             à à evalblock
         L     15,0(,15)               à evalblock
         USING EVALBLOCK,15
         MVC   RXSTRL,EVALBLOCK_EVLEN  initialize retstr length
         LA    0,EVALBLOCK_EVDATA      à string
         ST    0,RXSTRà                -> plist
         DROP  15
*
         L     1,EFPLARG               à argtable
         DROP  1
         USING ARGTABLE_ENTRY,1
         SR    14,14                   arg count
         LA    15,ARGV                 arg copy ptr
ARGLOOP  CLC   ARGTABLE_END,0(1)       end of table ?
         JE    CALLPIPI                Yes
         MVC   0(4,15),ARGTABLE_ARGSTRING_LENGTH
         MVC   4(4,15),ARGTABLE_ARGSTRING_PTR
         LA    14,1(,14)               # args + 1
         LA    15,8(,15)
         LA    1,ARGTABLE_NEXT         à next entry
         J     ARGLOOP                 scan passed argtable
*
CALLPIPI DS    0H
         ST    14,ARGC                 # arguments
         L     15,CCINIPTR   à CEEPIPI
         LA    1,CALLPL      à CALL plist for CEEPIPI
         BALR  14,15         Invoke CEEPIPI CALL
         LTR   2,15          Check return code
         JZ    CALLDONE      If zero, exit
         ABEND (2),DUMP      Abend with bad RC and dump memory
*
CALLDONE DS    0H
         L     1,4(,13)      à prev savearea
         L     1,24(,1)      REXX R1 = à efpl
         USING EFPL,1
         L     15,EFPLEVAL   à à evalblock
         DROP  1
         L     15,0(,15)     à evalblock
         USING EVALBLOCK,15
         L     1,RXSTRL      retstr length
         LTR   1,1           any value returned ?
         JNP   TERM          No
         ST    1,EVALBLOCK_EVLEN length -> evalblock
         BCTR  1,0
         L     14,RXSTRà     à retstr
         LA    15,EVALBLOCK_EVDATA  à string in evalblock
         DROP  15
         MVC   0(*-*,15),0(14)
         EX    1,*-6
*
TERM     DS    0H
         LA    2,4
         C     2,SUBRETC     Is it TERM call ?
         JNE   RC0           No
*
         L     15,CCINIPTR   à CEEPIPI
         LA    1,TERMPL      à TERM plist for CEEPIPI
         BALR  14,15         Invoke CEEPIPI TERM
         LTR   2,15          Check return code
         JZ    DELETE        If zero, delete CEEPIPI
         ABEND (2),DUMP      Abend with bad RC and dump memory
*
DELETE   DS    0H
         DELETE EP=RXMQINIT  Decrease my own load count
*
         DELETE EP=CEEPIPI   Delete CEEPIPI from memory
         ST    2,CCINIPTR    Clear EP address
*
         CALL  IEANTDL,(LEVEL,USERNAME,RETCODE)   Delete user token
         LA    2,IEANT_OK    Make 0 for comparison
         C     2,RETCODE     Was create successful ?
         JE    RC0           Yes
         ABEND (2),DUMP
*
RC0      LA    15,0          Return code = 0
DONE     L     13,4(13)      Get address of caller's save area
         L     14,12(13)     Get return address
         LM    0,12,20(13)   Restore caller's registers
         BR    14            Branch back to caller
*
CCSAVE   DC    18F'0'        Our savearea
*        Parms for user token interface
LEVEL    DC    A(IEANT_TASK_LEVEL)      TCB-related token
USERNAME DC    CL16'MA95 SUPPORT PACK' User token name
USERTOK  DC    0F                       User token value (4 words)
CCINIPTR DC    A(0)          à CEEPIPI
TOKEN    DC    F'0'          Token received from INIT
         DC    2A(0)         reserved
PERSOPT  DC    A(IEANT_NOPERSIST)       No checkpoint/restart permitted
RETCODE  DC    F'0'                     Return code
*
CCPARM   DS    0F            Plist passed to C++ functions
         DC    A(FUNCNAME)   à REXX function name
ARGC     DC    A(0)          à argc
         DC    A(ARGV)       à argv
         DC    A(0)          à qname (dummy)
         DC    A(àRXSTR)     à RXSTRING retstr
àRXSTR   DC    0F            This is struct RXSTRING
RXSTRL   DC    F'0'          retstr length
RXSTRà   DC    A(0)          retstr ptr
*
ARGV     DC    20A(0)        space for 10 arguments
SAVEEB   DC    F'0'          à REXX Environment block
*
CALLPL   DS    0F            Plist passed to CEEPIPI for CALL func
         DC    A(CALLSUB)
         DC    A(PTBINDEX)
         DC    A(TOKEN)
         DC    A(PARMPTR)
         DC    A(SUBRETC)
         DC    A(SUBRSNC)
         DC    A(SUBFBC)
CALLSUB  DC    F'4'          call_sub code
PTBINDEX DC    F'0'          CEEXPTBL index for RXMQINIT
FUNCNAME DC    XL12'00'      For function name
PARMPTR  DC    A(CCPARM)     à plist passed to C++ function
SUBRETC  DS    F             Function return code
SUBRSNC  DS    F             Function reason code
SUBFBC   DS    3F            Function feedback code
*
INITPL   DS    0F            Plist passed to CEEPIPI for INIT func
         DC    A(INITSUB)
         DC    A(àCEXPTBL)
         DC    A(àSRVRTNS)
         DC    A(RUNTMOPT)
         DC    A(TOKEN)
INITSUB  DC    F'9'          init_sub_dp code
àCEXPTBL DC    A(PPTBL)      à CEEXPTBL
àSRVRTNS DC    A(0)          à service routine vector
*                            LE Run-time options:
*UNTMOPT DC    CL255' '                no options
RUNTMOPT DC    CL255'TRAP(OFF,NOSPIE)' turn off exception processing
*
TERMPL   DS    0F            Plist passed to CEEPIPI for TERM func
         DC    A(TERMSUB)
         DC    A(TOKEN)
         DC    A(ENV_RC)
TERMSUB  DC    F'5'          term code
ENV_RC   DC    F'0'          Return code
*---------------------------------------------------------------------*
*        Preinitialization table
*        Attention! Table entries should be in the same order
*        as CCSTUBS entry points
*---------------------------------------------------------------------*
         EXTRN CPPMINIT
         EXTRN CPPMTERM
         EXTRN CPPMCONS
         EXTRN CPPMCONN
         EXTRN CPPMOPEN
         EXTRN CPPMCLOS
         EXTRN CPPMDISC
         EXTRN CPPMCMIT
         EXTRN CPPMBACK
         EXTRN CPPMPUT
         EXTRN CPPMPUT1
         EXTRN CPPMGET
         EXTRN CPPMINQ
         EXTRN CPPMSET
         EXTRN CPPMSUB
         EXTRN CPPMBRWS
         EXTRN CPPMHXT
         EXTRN CPPMEVNT
         EXTRN CPPMTM
         EXTRN CPPMC
         EXTRN CPPMV
         EXTRN CPPMVC
         EXTRN CPPMMH
         EXTRN CPPMDMH
         EXTRN CPPMSMP
         EXTRN CPPMIMP
         EXTRN CPPMDMP
         EXTRN CPPMBMH
         EXTRN CPPMMBF
*                 1st parameter below is not used
PPTBL    CEEXPIT
         CEEXPITY RXMQINIT,CPPMINIT+X'80000000'
         CEEXPITY RXMQTERM,CPPMTERM+X'80000000'
         CEEXPITY RXMQCONS,CPPMCONS+X'80000000'
         CEEXPITY RXMQCONN,CPPMCONN+X'80000000'
         CEEXPITY RXMQOPEN,CPPMOPEN+X'80000000'
         CEEXPITY RXMQCLOS,CPPMCLOS+X'80000000'
         CEEXPITY RXMQDISC,CPPMDISC+X'80000000'
         CEEXPITY RXMQCMIT,CPPMCMIT+X'80000000'
         CEEXPITY RXMQBACK,CPPMBACK+X'80000000'
         CEEXPITY RXMQPUT,CPPMPUT+X'80000000'
         CEEXPITY RXMQPUT1,CPPMPUT1+X'80000000'
         CEEXPITY RXMQGET,CPPMGET+X'80000000'
         CEEXPITY RXMQINQ,CPPMINQ+X'80000000'
         CEEXPITY RXMQSET,CPPMSET+X'80000000'
         CEEXPITY RXMQSUB,CPPMSUB+X'80000000'
         CEEXPITY RXMQBRWS,CPPMBRWS+X'80000000'
         CEEXPITY RXMQHXT,CPPMHXT+X'80000000'
         CEEXPITY RXMQEVNT,CPPMEVNT+X'80000000'
         CEEXPITY RXMQTM,CPPMTM+X'80000000'
         CEEXPITY RXMQC,CPPMC+X'80000000'
         CEEXPITY RXMQV,CPPMV+X'80000000'
         CEEXPITY RXMQVC,CPPMVC+X'80000000'
         CEEXPITY RXMQMH,CPPMMH+X'80000000'
         CEEXPITY RXMQDMH,CPPMDMH+X'80000000'
         CEEXPITY RXMQSMP,CPPMSMP+X'80000000'
         CEEXPITY RXMQIMP,CPPMIMP+X'80000000'
         CEEXPITY RXMQDMP,CPPMDMP+X'80000000'
         CEEXPITY RXMQBMH,CPPMBMH+X'80000000'
         CEEXPITY RXMQMBF,CPPMMBF+X'80000000'
         CEEXPITS
*
         LTORG
         DROP  12
*
         IRXARGTB DECLARE=YES
         IRXEFPL
         IRXEVALB
         IEANTASM
         END   CCSTUBS
***********************************************************************
*        extern "OS" int RXSAY (char*, int);                          *
***********************************************************************
RXSAY    TITLE 'Assembler stub for REXX IRXSAY function'
RXSAY    CSECT
RXSAY    AMODE 31
RXSAY    RMODE ANY
         EDCPRLG
*
         L     15,àSAVEEB    à à Envblock
         L     15,0(,15)     à Envblock
         MVC   àSAYSTR,0(1)  à string
         L     1,4(,1)       à length
         LA    1,0(,1)       clear high order bit
         ST    1,PLSAY+8     à length -> plist
         LA    1,PLSAY       à plist for IRXSAY
         USING ENVBLOCK,15
         L     15,ENVBLOCK_IRXEXTE     à Irxexte
         DROP  15
         USING IRXEXTE,15
         L     15,IRXSAY               à IRXSAY
         DROP  15
         BALR  14,15
*
         EDCEPIL
*
PLSAY    DS    0F
         DC    A(FNNAME)     à 'WRITE'
         DC    A(àSAYSTR)    à à string
         DC    A(0)          à length
àSAVEEB  DC    V(SAVEEB)     à envblock
         DC    A(RETCODE+X'80000000')
FNNAME   DC    CL8'WRITE'
àSAYSTR  DC    A(0)          à string
RETCODE  DC    F'0'
*
         LTORG
         IRXENVB             Environment block
         IRXEXTE             External Entry Points
         END
***********************************************************************
*        extern "OS" int RXEXCOM (struct shvblock_mvs_t*);            *
***********************************************************************
RXEXCOM  TITLE 'Assembler stub for REXX IRXEXCOM function'
RXEXCOM  CSECT
RXEXCOM  AMODE 31
RXEXCOM  RMODE ANY
         EDCPRLG
*
         L     15,àSAVEEB    à à Envblock
         L     15,0(15)      à Envblock
         L     1,0(,1)       à Shvblock
         LA    1,0(,1)       clear high order bit
         ST    1,PLEXCOM+12  à Shvblock -> plist
         LA    1,PLEXCOM     à plist for IRXEXCOM
         USING ENVBLOCK,15
         L     15,ENVBLOCK_IRXEXTE     à Irxexte
         DROP  15
         USING IRXEXTE,15
         L     15,IRXEXCOM             à IRXEXCOM
         DROP  15
         BALR  14,15
*
         EDCEPIL
*
PLEXCOM  DS    0F
         DC    A(EXNAME)     à 'IRXEXCOM'
         DC    A(0)          must be 0
         DC    A(0)          must be 0
         DC    A(0)          à MVS shvblock
àSAVEEB  DC    V(SAVEEB)     à envblock
         DC    A(RETCODE+X'80000000')
EXNAME   DC    CL8'IRXEXCOM'
RETCODE  DC    F'0'
*
         LTORG
         IRXENVB             Environment block
         IRXEXTE             External Entry Points
         END
